/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbc.definition.enumeratedtype;

/**
 *
 * @author N8187 久保田 英男
 */
public enum ServiceCategoryShurui {

    /**
     * サービス種類が「訪問介護」であることを表します。
     */
    訪問介護,
    /**
     * サービス種類が「訪問入浴」であることを表します。
     */
    訪問入浴,
    /**
     * サービス種類が「訪問看護」であることを表します。
     */
    訪問看護,
    /**
     * サービス種類が「訪問リハビリ」であることを表します。
     */
    訪問リハビリ,
    /**
     * サービス種類が「通所介護」であることを表します。
     */
    通所介護,
    /**
     * サービス種類が「通所リハビリ」であることを表します。
     */
    通所リハビリ,
    /**
     * サービス種類が「福祉用具貸与」であることを表します。
     */
    福祉用具貸与,
    /**
     * サービス種類が「予防訪問介護」であることを表します。
     */
    予防訪問介護,
    /**
     * サービス種類が「予防訪問入浴」であることを表します。
     */
    予防訪問入浴,
    /**
     * サービス種類が「予防訪問看護」であることを表します。
     */
    予防訪問看護,
    /**
     * サービス種類が「予防訪問リハビリ」であることを表します。
     */
    予防訪問リハビリ,
    /**
     * サービス種類が「予防通所介護」であることを表します。
     */
    予防通所介護,
    /**
     * サービス種類が「予防通所リハビリ」であることを表します。
     */
    予防通所リハビリ,
    /**
     * サービス種類が「予防福祉用具貸与」であることを表します。
     */
    予防福祉用具貸与,
    /**
     * サービス種類が「生活介護」であることを表します。
     */
    生活介護,
    /**
     * サービス種類が「療養介護老人保険施設」であることを表します。
     */
    療養介護老人保険施設,
    /**
     * サービス種類が「療養介護療養型医療施設等」であることを表します。
     */
    療養介護療養型医療施設等,
    /**
     * サービス種類が「予防生活介護」であることを表します。
     */
    予防生活介護,
    /**
     * サービス種類が「予防療養介護老人保険施設」であることを表します。
     */
    予防療養介護老人保険施設,
    /**
     * サービス種類が「予防療養介護療養型医療施設等」であることを表します。
     */
    予防療養介護療養型医療施設等,
    /**
     * サービス種類が「出来高請求費」であることを表します。
     */
    出来高請求費,
    //    出来高請求費短期入所療養介護２,
    //    出来高請求費短期入所療養介護３,
    //    出来高請求費短期入所療養介護４,
    /**
     * サービス種類が「居宅療養管理指導」であることを表します。
     */
    居宅療養管理指導,
    /**
     * サービス種類が「特定施設入所者生活介護」であることを表します。
     */
    特定施設入所者生活介護,
    /**
     * サービス種類が「予防居宅療養管理指導」であることを表します。
     */
    予防居宅療養管理指導,
    /**
     * サービス種類が「予防特定施設入所者生活介護」であることを表します。
     */
    予防特定施設入所者生活介護,
    /**
     * サービス種類が「認知症対応型共同生活介護」であることを表します。
     */
    認知症対応型共同生活介護,
    /**
     * サービス種類が「地域密着特定施設入所者生活介護」であることを表します。
     */
    地域密着特定施設入所者生活介護,
    /**
     * サービス種類が「認知症対応型共同生活短期」であることを表します。
     */
    認知症対応型共同生活短期,
    /**
     * サービス種類が「夜間対応型訪問介護」であることを表します。
     */
    夜間対応型訪問介護,
    /**
     * サービス種類が「認知症対応型通所介護」であることを表します。
     */
    認知症対応型通所介護,
    /**
     * サービス種類が「小規模多機能型居宅介護」であることを表します。
     */
    小規模多機能型居宅介護,
    /**
     * サービス種類が「予防認知症対応型共同生活介護」であることを表します。
     */
    予防認知症対応型共同生活介護,
    /**
     * サービス種類が「予防認知症対応型共同生活短期」であることを表します。
     */
    予防認知症対応型共同生活短期,
    /**
     * サービス種類が「予防認知症対応型通所介護」であることを表します。
     */
    予防認知症対応型通所介護,
    /**
     * サービス種類が「予防小規模多機能型居宅介護」であることを表します。
     */
    予防小規模多機能型居宅介護,
    /**
     * サービス種類が「居宅介護」であることを表します。
     */
    居宅介護,
    /**
     * サービス種類が「予防居宅介護」であることを表します。
     */
    予防居宅介護,
    /**
     * サービス種類が「介護福祉施設サービス」であることを表します。
     */
    介護福祉施設サービス,
    /**
     * サービス種類が「介護保健施設サービス」であることを表します。
     */
    介護保健施設サービス,
    /**
     * サービス種類が「介護療養施設サービス」であることを表します。
     */
    介護療養施設サービス,
    /**
     * サービス種類が「地域密着型介護老人福祉施設」であることを表します。
     */
    地域密着型介護老人福祉施設;
//    出来高請求費１,
//    出来高請求費２;
}
