/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbc.definition.enumeratedtype;

/**
 *
 * @author N8187 久保田 英男
 */
public enum ServiceCategoryShurui {

    /**
     * 一覧表のサービス名を表します。 <br />
     */
    訪問介護,
    訪問入浴,
    訪問看護,
    訪問リハビリ,
    通所介護,
    通所リハビリ,
    福祉用具貸与,
    予防訪問介護,
    予防訪問入浴,
    予防訪問看護,
    予防訪問リハビリ,
    予防通所介護,
    予防通所リハビリ,
    予防福祉用具貸与,
    生活介護,
    療養介護老人保険施設,
    療養介護療養型医療施設等,
    予防生活介護,
    予防療養介護老人保険施設,
    予防療養介護療養型医療施設等,
    出来高請求費,
    //    出来高請求費短期入所療養介護２,
    //    出来高請求費短期入所療養介護３,
    //    出来高請求費短期入所療養介護４,
    居宅療養管理指導,
    特定施設入所者生活介護,
    予防居宅療養管理指導,
    予防特定施設入所者生活介護,
    認知症対応型共同生活介護,
    地域密着特定施設入所者生活介護,
    認知症対応型共同生活短期,
    夜間対応型訪問介護,
    認知症対応型通所介護,
    小規模多機能型居宅介護,
    予防認知症対応型共同生活介護,
    予防認知症対応型共同生活短期,
    予防認知症対応型通所介護,
    予防小規模多機能型居宅介護,
    居宅介護,
    予防居宅介護,
    介護福祉施設サービス,
    介護保健施設サービス,
    介護療養施設サービス,
    地域密着型介護老人福祉施設;
//    出来高請求費１,
//    出来高請求費２;
}
