/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.viewstate;

/**
 * 介護ののViewStateKeys
 *
 * @reamsid_L DBX-9999-023 wangchao
 */
public enum ViewStateKeys {

    /**
     * 審査会開催番号
     */
    審査会開催番号,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「広域内市町村情報」であることを表します
     */
    広域内市町村情報,
    /**
     * キーが「資格対象者」であることを表します
     */
    資格対象者,
    /**
     * キーが「賦課対象者」であることを表します。
     */
    賦課対象者,
    /**
     * 負担限度額認定申請の情報
     */
    負担限度額認定申請の情報,
    /**
     * new負担限度額認定申請の情報
     */
    new負担限度額認定申請の情報,
    /**
     * isReRequest
     */
    isReRequest,
    /**
     * 申請書管理番号
     */
    申請書管理番号,
    /**
     * 主治医意見書作成依頼履歴番号
     */
    主治医意見書作成依頼履歴番号,
    /**
     * 認定調査履歴番号
     */
    認定調査履歴番号,
    /**
     * 認定調査依頼情報
     */
    認定調査依頼情報,
    /**
     * 主治医意見書依頼情報
     */
    主治医意見書依頼情報,
    /**
     * タスク一覧_要介護認定完了情報
     */
    タスク一覧_要介護認定完了情報,
    /**
     * 認定調査履歴番号
     */
    調査実施日,
    /**
     * 調査実施場所
     */
    調査実施場所,
    /**
     * 実施場所名称
     */
    実施場所名称,
    /**
     * 所属機関
     */
    所属機関,
    /**
     * 記入者
     */
    記入者,
    /**
     * 帳票分類ID
     */
    帳票分類ID,
    /**
     * 帳票分類名称
     */
    帳票分類名称,
    /**
     * 転入保留対象者情報
     */
    転入保留対象者情報,
    /**
     * 転出保留対象者情報
     */
    転出保留対象者情報,
    /**
     * 開催予定日
     */
    開催予定日,
    /**
     * 審査会会場
     */
    審査会会場,
    /**
     * 開始予定時間
     */
    開始予定時間,
    /**
     * 資料作成
     */
    資料作成,
    /**
     * 合議体番号
     */
    合議体番号,
    /**
     * 合議体名称
     */
    合議体名称,
    /**
     * 予定定員
     */
    予定定員,
    /**
     * 割付人数
     */
    割付人数,
    /**
     * 開催番号
     */
    開催番号,
    /**
     * 処理日
     */
    処理日,
    /**
     * みなし2号登録情報
     */
    みなし2号登録情報,
    /**
     * 申請書管理番号リスト
     */
    申請書管理番号リスト,
    /**
     * 調査区分
     */
    調査区分,
    /**
     * 出力条件
     */
    出力条件,
    /**
     * 第一群認定調査基本情報リスト
     */
    第一群認定調査基本情報リスト,
    /**
     * 第二群認定調査基本情報リスト
     */
    第二群認定調査基本情報リスト,
    /**
     * 第三群認定調査基本情報リスト
     */
    第三群認定調査基本情報リスト,
    /**
     * 第四群認定調査基本情報リスト
     */
    第四群認定調査基本情報リスト,
    /**
     * 第五群認定調査基本情報リスト
     */
    第五群認定調査基本情報リスト,
    /**
     * 第六群認定調査基本情報リスト
     */
    第六群認定調査基本情報リスト,
    /**
     * 第七群認定調査基本情報リスト
     */
    第七群認定調査基本情報リスト,
    /**
     * 介護問合せ先情報
     */
    介護問合せ先情報,
    /**
     * 支所コード
     */
    支所コード,
    /**
     * 証記載保険者番号
     */
    証記載保険者番号,
    /**
     * 認定調査委託先コード
     */
    認定調査委託先コード,
    /**
     * 調査員コード
     */
    調査員コード,
    /**
     * 要介護認定完了情報
     */
    要介護認定完了情報,
    /**
     * 保険者名称
     */
    保険者名称,
    /**
     * 認定調査委託先割付定員
     */
    認定調査委託先割付定員,
    /**
     * 調査員割付可能人数/月
     */
    調査員割付可能人数_月,
    /**
     * 帳票制御汎用メンテナンスGrid
     */
    帳票制御汎用メンテナンスGrid,
    /**
     * 利用者負担額減額情報のDBList
     */
    利用者負担額減額情報のDBList,
    /**
     * 利用者負担額減額情報ListのViewState
     */
    利用者負担額減額情報ListのViewState,
    /**
     * 該当DB申請
     */
    該当DB申請,
    /**
     * 該当申請のViewState
     */
    該当申請のViewState,
    /**
     * 新規申請の履歴番号
     */
    新規申請の履歴番号,
    /**
     * 世帯所得一覧初期化済み
     */
    世帯所得一覧初期化済み,
    /**
     * 介護認定審査会番号
     */
    介護認定審査会番号,
    /**
     * キーが「賦課照会キー」であることを表します。
     */
    賦課照会キー,
    /**
     * キーが「前履歴キー」であることを表します。
     */
    前履歴キー,
    /**
     * キーが「賦課比較キー」であることを表します。
     */
    賦課比較キー,
    /**
     * 審査請求届出日
     */
    審査請求届出日,
    /**
     * 弁明書作成日
     */
    弁明書作成日,
    /**
     * モード
     */
    モード,
    /**
     * 弁明登録情報
     */
    弁明登録情報,
    /**
     * 不服審査申立情報
     */
    不服審査申立情報,
    /**
     * 弁明内容
     */
    弁明内容,
    /**
     * 弁明者情報
     */
    弁明者情報,
    /**
     * 補正検索画面情報
     */
    補正検索画面情報,
    /**
     * 開催場所情報一覧
     */
    開催場所情報一覧,
    /**
     * 保険料収納状況データ
     */
    保険料収納状況データ,
    /**
     * 保険給付支払状況データ
     */
    保険給付支払状況データ,
    /**
     * 件数データグリッド。
     */
    件数データグリッド,
    /**
     * 費用額データグリッド。
     */
    費用額データグリッド,
    /**
     * 給付額データグリッド。
     */
    給付額データグリッド,
    /**
     * 状態
     */
    状態,
    /**
     * 認定調査員マスタ検索結果
     */
    認定調査員マスタ検索結果,
    /**
     * 合議体情報
     */
    合議体情報,
    /**
     * 審査会開催結果登録
     */
    審査会開催結果登録,
    /**
     * 合議体情報更新
     */
    合議体情報更新,
    /**
     * 主治医マスタ検索結果
     */
    主治医マスタ検索結果,
    /**
     * 主治医医療機関マスタ検索結果
     */
    主治医医療機関マスタ検索結果,
    /**
     * 調査地区グループ調査地区一覧検索結果
     */
    調査地区グループ調査地区一覧結果,
    /**
     * 台帳種別表示
     */
    台帳種別表示,
    /**
     * 施設入退所情報
     */
    施設入退所情報,
    /**
     * 被保険者
     */
    被保険者,
    /**
     * 他市町村住所地特例者
     */
    他市町村住所地特例者,
    /**
     * 適用除外者
     */
    適用除外者,
    /**
     * 介護認定審査会委員情報
     */
    介護認定審査会委員情報,
    /**
     * 介護認定審査会委員情報更新
     */
    介護認定審査会委員情報更新,
    /**
     * 医療保険情報
     */
    医療保険情報,
    /**
     * 決定情報
     */
    決定情報,
    /**
     * 業務区分
     */
    業務区分,
    /**
     * サービス提供年月
     */
    サービス提供年月,
    /**
     * 整理番号
     */
    整理番号,
    /**
     * 支払金額合計
     */
    支払金額合計,
    /**
     * 支給申請情報パラメータ
     */
    支給申請情報パラメータ,
    /**
     * 業務内区分コード
     */
    業務内区分コード,
    /**
     * 償還払申請一覧
     */
    償還払申請一覧,
    /**
     * サービス年月
     */
    サービス年月,
    /**
     * サービス年月From
     */
    サービス年月From,
    /**
     * サービス年月To
     */
    サービス年月To,
    /**
     * 決定日
     */
    決定日,
    /**
     * 申請日
     */
    申請日,
    /**
     * 事業者番号
     */
    事業者番号,
    /**
     * 明細番号
     */
    明細番号,
    /**
     * 様式番号
     */
    様式番号,
    /**
     * 履歴番号
     */
    履歴番号,
    /**
     * 老健受給情報
     */
    老健受給情報,
    /**
     * 商品名
     */
    商品名,
    /**
     * 製造事業者
     */
    製造事業者,
    /**
     * 品目コード
     */
    品目コード,
    /**
     * 福祉用具商品名入力ガイド検索結果
     */
    福祉用具商品名入力ガイド検索結果,
    /**
     * 境界層該当者情報
     */
    境界層該当者情報,
    /**
     * 境界層措置申請情報
     */
    境界層措置申請情報,
    /**
     * 境界層保険料段階情報
     */
    境界層保険料段階情報,
    /**
     * 賦課エラー一覧
     */
    賦課エラー一覧,
    /**
     * 賦課エラー情報
     */
    賦課エラー情報,
    /**
     * 設定年月
     */
    設定年月,
    /**
     * 調査地区コード
     */
    調査地区コード,
    /**
     * 市町村コード
     */
    市町村コード,
    /**
     * 介護認定審査会委員コード
     */
    介護認定審査会委員コード,
    /**
     * 審査会委員名称
     */
    審査会委員名称,
    /**
     * 償還払決定一覧情報
     */
    償還払決定一覧情報,
    /**
     * 年度
     */
    年度,
     /**
     * 転入保留特定住所一覧情報
     */
    転入保留特定住所一覧情報,
     /**
     * その他機関選択ガイド_モード
     */
    その他機関選択ガイド_モード
}
