/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.viewstate;

/**
 * 介護ののViewStateKeys
 *
 * @reamsid_L DBX-9999-023 wangchao
 */
public enum ViewStateKeys {

    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「広域内市町村情報」であることを表します
     */
    広域内市町村情報,
    /**
     * キーが「資格対象者」であることを表します
     */
    資格対象者,
    /**
     * 負担限度額認定申請の情報
     */
    負担限度額認定申請の情報,
    /**
     * new負担限度額認定申請の情報
     */
    new負担限度額認定申請の情報,
    /**
     * isReRequest
     */
    isReRequest,
    /**
     * 申請書管理番号
     */
    申請書管理番号,
    /**
     * 主治医意見書作成依頼履歴番号
     */
    主治医意見書作成依頼履歴番号,
    /**
     * 認定調査履歴番号
     */
    認定調査履歴番号,
    /**
     * 認定調査依頼情報
     */
    認定調査依頼情報,
    /**
     * 主治医意見書依頼情報
     */
    主治医意見書依頼情報,
    /**
     * タスク一覧_要介護認定完了情報
     */
    タスク一覧_要介護認定完了情報,
    /**
     * 認定調査履歴番号
     */
    調査実施日,
    /**
     * 調査実施場所
     */
    調査実施場所,
    /**
     * 実施場所名称
     */
    実施場所名称,
    /**
     * 所属機関
     */
    所属機関,
    /**
     * 記入者
     */
    記入者,
    /**
     * 帳票分類ID
     */
    帳票分類ID,
    /**
     * 帳票分類名称
     */
    帳票分類名称,
    /**
     * 転入保留対象者情報
     */
    転入保留対象者情報,
    /**
     * 転出保留対象者情報
     */
    転出保留対象者情報,
    /**
     * 開催予定日
     */
    開催予定日,
    /**
     * 審査会会場
     */
    審査会会場,
    /**
     * 開始予定時間
     */
    開始予定時間,
    /**
     * 資料作成
     */
    資料作成,
    /**
     * 合議体番号
     */
    合議体番号,
    /**
     * 合議体名称
     */
    合議体名称,
    /**
     * 予定定員
     */
    予定定員,
    /**
     * 割付人数
     */
    割付人数,
    /**
     * 開催番号
     */
    開催番号,
    /**
     * 処理日
     */
    処理日,
    /**
     * 申請書管理番号リスト
     */
    申請書管理番号リスト,
    /**
     * 調査区分
     */
    調査区分;
}
