/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.viewstate;

/**
 * 介護ののViewStateKeys
 *
 * @reamsid_L DBX-9999-023 wangchao
 */
public enum ViewStateKeys {

    /**
     * 審査会開催番号
     */
    審査会開催番号,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「広域内市町村情報」であることを表します
     */
    広域内市町村情報,
    /**
     * キーが「資格対象者」であることを表します
     */
    資格対象者,
    /**
     * キーが「賦課対象者」であることを表します。
     */
    賦課対象者,
    /**
     * 負担限度額認定申請の情報
     */
    負担限度額認定申請の情報,
    /**
     * new負担限度額認定申請の情報
     */
    new負担限度額認定申請の情報,
    /**
     * isReRequest
     */
    isReRequest,
    /**
     * 申請書管理番号
     */
    申請書管理番号,
    /**
     * 主治医意見書作成依頼履歴番号
     */
    主治医意見書作成依頼履歴番号,
    /**
     * 認定調査履歴番号
     */
    認定調査履歴番号,
    /**
     * 認定調査依頼情報
     */
    認定調査依頼情報,
    /**
     * 主治医意見書依頼情報
     */
    主治医意見書依頼情報,
    /**
     * タスク一覧_要介護認定完了情報
     */
    タスク一覧_要介護認定完了情報,
    /**
     * 認定調査履歴番号
     */
    調査実施日,
    /**
     * 調査実施場所
     */
    調査実施場所,
    /**
     * 実施場所名称
     */
    実施場所名称,
    /**
     * 所属機関
     */
    所属機関,
    /**
     * 記入者
     */
    記入者,
    /**
     * 帳票分類ID
     */
    帳票分類ID,
    /**
     * 帳票分類名称
     */
    帳票分類名称,
    /**
     * 転入保留対象者情報
     */
    転入保留対象者情報,
    /**
     * 転出保留対象者情報
     */
    転出保留対象者情報,
    /**
     * 開催予定日
     */
    開催予定日,
    /**
     * 審査会会場
     */
    審査会会場,
    /**
     * 開始予定時間
     */
    開始予定時間,
    /**
     * 資料作成
     */
    資料作成,
    /**
     * 合議体番号
     */
    合議体番号,
    /**
     * 合議体名称
     */
    合議体名称,
    /**
     * 予定定員
     */
    予定定員,
    /**
     * 割付人数
     */
    割付人数,
    /**
     * 開催番号
     */
    開催番号,
    /**
     * 処理日
     */
    処理日,
    /**
     * みなし2号登録情報
     */
    みなし2号登録情報,
    /**
     * 申請書管理番号リスト
     */
    申請書管理番号リスト,
    /**
     * 調査区分
     */
    調査区分,
    /**
     * 出力条件
     */
    出力条件,
    /**
     * 第一群認定調査基本情報リスト
     */
    第一群認定調査基本情報リスト,
    /**
     * 第二群認定調査基本情報リスト
     */
    第二群認定調査基本情報リスト,
    /**
     * 第三群認定調査基本情報リスト
     */
    第三群認定調査基本情報リスト,
    /**
     * 第四群認定調査基本情報リスト
     */
    第四群認定調査基本情報リスト,
    /**
     * 第五群認定調査基本情報リスト
     */
    第五群認定調査基本情報リスト,
    /**
     * 第六群認定調査基本情報リスト
     */
    第六群認定調査基本情報リスト,
    /**
     * 第七群認定調査基本情報リスト
     */
    第七群認定調査基本情報リスト,
    /**
     * 介護問合せ先情報
     */
    介護問合せ先情報,
    /**
     * 支所コード
     */
    支所コード,
    /**
     * 証記載保険者番号
     */
    証記載保険者番号,
    /**
     * 認定調査委託先コード
     */
    認定調査委託先コード,
    /**
     * 調査員コード
     */
    調査員コード,
    /**
     * 要介護認定完了情報
     */
    要介護認定完了情報,
    /**
     * 保険者名称
     */
    保険者名称,
    /**
     * 認定調査委託先割付定員
     */
    認定調査委託先割付定員,
    /**
     * 調査員割付可能人数/月
     */
    調査員割付可能人数_月,
    /**
     * 帳票制御汎用メンテナンスGrid
     */
    帳票制御汎用メンテナンスGrid,
    /**
     * 利用者負担額減額情報のDBList
     */
    利用者負担額減額情報のDBList,
    /**
     * 利用者負担額減額情報ListのViewState
     */
    利用者負担額減額情報ListのViewState,
    /**
     * 該当DB申請
     */
    該当DB申請,
    /**
     * 該当申請のViewState
     */
    該当申請のViewState,
    /**
     * 新規申請の履歴番号
     */
    新規申請の履歴番号,
    /**
     * 世帯所得一覧初期化済み
     */
    世帯所得一覧初期化済み,
    /**
     * 介護認定審査会番号
     */
    介護認定審査会番号,
    /**
     * キーが「賦課照会キー」であることを表します。
     */
    賦課照会キー,
    /**
     * キーが「前履歴キー」であることを表します。
     */
    前履歴キー,
    /**
     * キーが「賦課比較キー」であることを表します。
     */
    賦課比較キー,
}
