/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.viewstate;

/**
 * 介護ののViewStateKeys
 *
 * @reamsid_L DBX-9999-023 wangchao
 */
public enum ViewStateKeys {

    /**
     * 審査会開催番号
     */
    審査会開催番号,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「広域内市町村情報」であることを表します
     */
    広域内市町村情報,
    /**
     * キーが「資格対象者」であることを表します
     */
    資格対象者,
    /**
     * キーが「賦課対象者」であることを表します。
     */
    賦課対象者,
    /**
     * 負担限度額認定申請の情報
     */
    負担限度額認定申請の情報,
    /**
     * new負担限度額認定申請の情報
     */
    new負担限度額認定申請の情報,
    /**
     * isReRequest
     */
    isReRequest,
    /**
     * 申請書管理番号
     */
    申請書管理番号,
    /**
     * 主治医意見書作成依頼履歴番号
     */
    主治医意見書作成依頼履歴番号,
    /**
     * 認定調査履歴番号
     */
    認定調査履歴番号,
    /**
     * 認定調査依頼情報
     */
    認定調査依頼情報,
    /**
     * 主治医意見書依頼情報
     */
    主治医意見書依頼情報,
    /**
     * タスク一覧_要介護認定完了情報
     */
    タスク一覧_要介護認定完了情報,
    /**
     * 認定調査履歴番号
     */
    調査実施日,
    /**
     * 調査実施場所
     */
    調査実施場所,
    /**
     * 実施場所名称
     */
    実施場所名称,
    /**
     * 所属機関
     */
    所属機関,
    /**
     * 記入者
     */
    記入者,
    /**
     * 帳票分類ID
     */
    帳票分類ID,
    /**
     * 帳票分類名称
     */
    帳票分類名称,
    /**
     * 転入保留対象者情報
     */
    転入保留対象者情報,
    /**
     * 転出保留対象者情報
     */
    転出保留対象者情報,
    /**
     * 開催予定日
     */
    開催予定日,
    /**
     * 審査会会場
     */
    審査会会場,
    /**
     * 開始予定時間
     */
    開始予定時間,
    /**
     * 資料作成
     */
    資料作成,
    /**
     * 合議体番号
     */
    合議体番号,
    /**
     * 合議体名称
     */
    合議体名称,
    /**
     * 予定定員
     */
    予定定員,
    /**
     * 割付人数
     */
    割付人数,
    /**
     * 開催番号
     */
    開催番号,
    /**
     * 処理日
     */
    処理日,
    /**
     * みなし2号登録情報
     */
    みなし2号登録情報,
    /**
     * 申請書管理番号リスト
     */
    申請書管理番号リスト,
    /**
     * 調査区分
     */
    調査区分,
    /**
     * 出力条件
     */
    出力条件,
    /**
     * 第一群認定調査基本情報リスト
     */
    第一群認定調査基本情報リスト,
    /**
     * 第二群認定調査基本情報リスト
     */
    第二群認定調査基本情報リスト,
    /**
     * 第三群認定調査基本情報リスト
     */
    第三群認定調査基本情報リスト,
    /**
     * 第四群認定調査基本情報リスト
     */
    第四群認定調査基本情報リスト,
    /**
     * 第五群認定調査基本情報リスト
     */
    第五群認定調査基本情報リスト,
    /**
     * 第六群認定調査基本情報リスト
     */
    第六群認定調査基本情報リスト,
    /**
     * 第七群認定調査基本情報リスト
     */
    第七群認定調査基本情報リスト,
    /**
     * 介護問合せ先情報
     */
    介護問合せ先情報,
    /**
     * 支所コード
     */
    支所コード,
    /**
     * 証記載保険者番号
     */
    証記載保険者番号,
    /**
     * 認定調査委託先コード
     */
    認定調査委託先コード,
    /**
     * 調査員コード
     */
    調査員コード,
    /**
     * 要介護認定完了情報
     */
    要介護認定完了情報,
    /**
     * 保険者名称
     */
    保険者名称,
    /**
     * 認定調査委託先割付定員
     */
    認定調査委託先割付定員,
    /**
     * 調査員割付可能人数/月
     */
    調査員割付可能人数_月,
    /**
     * 帳票制御汎用メンテナンスGrid
     */
    帳票制御汎用メンテナンスGrid,
    /**
     * 利用者負担額減額情報のDBList
     */
    利用者負担額減額情報のDBList,
    /**
     * 利用者負担額減額情報ListのViewState
     */
    利用者負担額減額情報ListのViewState,
    /**
     * 該当DB申請
     */
    該当DB申請,
    /**
     * 該当申請のViewState
     */
    該当申請のViewState,
    /**
     * 新規申請の履歴番号
     */
    新規申請の履歴番号,
    /**
     * 世帯所得一覧初期化済み
     */
    世帯所得一覧初期化済み,
    /**
     * 介護認定審査会番号
     */
    介護認定審査会番号,
    /**
     * キーが「賦課照会キー」であることを表します。
     */
    賦課照会キー,
    /**
     * キーが「前履歴キー」であることを表します。
     */
    前履歴キー,
    /**
     * キーが「賦課比較キー」であることを表します。
     */
    賦課比較キー,
    /**
     * 審査請求届出日
     */
    審査請求届出日,
    /**
     * 弁明書作成日
     */
    弁明書作成日,
    /**
     * モード
     */
    モード,
    /**
     * 弁明登録情報
     */
    弁明登録情報,
    /**
     * 不服審査申立情報
     */
    不服審査申立情報,
    /**
     * 弁明内容
     */
    弁明内容,
    /**
     * 弁明者情報
     */
    弁明者情報,
    /**
     * 補正検索画面情報
     */
    補正検索画面情報,
    /**
     * 開催場所情報一覧
     */
    開催場所情報一覧,
    /**
     * 保険料収納状況データ
     */
    保険料収納状況データ,
    /**
     * 保険給付支払状況データ
     */
    保険給付支払状況データ,
    /**
     * 件数データグリッド。
     */
    件数データグリッド,
    /**
     * 費用額データグリッド。
     */
    費用額データグリッド,
    /**
     * 給付額データグリッド。
     */
    給付額データグリッド,
    /**
     * 状態
     */
    状態,
    /**
     * 認定調査員マスタ検索結果
     */
    認定調査員マスタ検索結果,
    /**
     * 合議体情報
     */
    合議体情報,
    /**
     * 審査会開催結果登録
     */
    審査会開催結果登録,
    /**
     * 合議体情報更新
     */
    合議体情報更新,
    /**
     * 主治医マスタ検索結果
     */
    主治医マスタ検索結果,
    /**
     * 主治医医療機関マスタ検索結果
     */
    主治医医療機関マスタ検索結果,
    /**
     * 調査地区グループ調査地区一覧検索結果
     */
    調査地区グループ調査地区一覧結果,
    /**
     * 台帳種別表示
     */
    台帳種別表示,
    /**
     * 施設入退所情報
     */
    施設入退所情報,
    /**
     * 被保険者
     */
    被保険者,
    /**
     * 他市町村住所地特例者
     */
    他市町村住所地特例者,
    /**
     * 適用除外者
     */
    適用除外者,
    /**
     * 介護認定審査会委員情報
     */
    介護認定審査会委員情報,
    /**
     * 介護認定審査会委員情報更新
     */
    介護認定審査会委員情報更新,
    /**
     * 医療保険情報
     */
    医療保険情報,
    /**
     * 決定情報
     */
    決定情報,
    /**
     * 業務区分
     */
    業務区分,
    /**
     * サービス提供年月
     */
    サービス提供年月,
    /**
     * 整理番号
     */
    整理番号,
    /**
     * 支払金額合計
     */
    支払金額合計,
    /**
     * 支給申請情報パラメータ
     */
    支給申請情報パラメータ,
    /**
     * 業務内区分コード
     */
    業務内区分コード,
    /**
     * 償還払申請一覧
     */
    償還払申請一覧,
    /**
     * サービス年月
     */
    サービス年月,
    /**
     * サービス年月From
     */
    サービス年月From,
    /**
     * サービス年月To
     */
    サービス年月To,
    /**
     * 決定日
     */
    決定日,
    /**
     * 申請日
     */
    申請日,
    /**
     * 事業者番号
     */
    事業者番号,
    /**
     * 明細番号
     */
    明細番号,
    /**
     * 様式番号
     */
    様式番号,
    /**
     * 履歴番号
     */
    履歴番号,
    /**
     * 老健受給情報
     */
    老健受給情報,
    /**
     * 商品名
     */
    商品名,
    /**
     * 製造事業者
     */
    製造事業者,
    /**
     * 品目コード
     */
    品目コード,
    /**
     * 福祉用具商品名入力ガイド検索結果
     */
    福祉用具商品名入力ガイド検索結果,
    /**
     * 境界層該当者情報
     */
    境界層該当者情報,
    /**
     * 境界層措置申請情報
     */
    境界層措置申請情報,
    /**
     * 境界層保険料段階情報
     */
    境界層保険料段階情報,
    /**
     * 賦課エラー一覧
     */
    賦課エラー一覧,
    /**
     * 賦課エラー情報
     */
    賦課エラー情報,
    /**
     * 設定年月
     */
    設定年月,
    /**
     * 調査地区コード
     */
    調査地区コード,
    /**
     * 市町村コード
     */
    市町村コード,
    /**
     * 介護認定審査会委員コード
     */
    介護認定審査会委員コード,
    /**
     * 審査会委員名称
     */
    審査会委員名称,
    /**
     * 償還払決定一覧情報
     */
    償還払決定一覧情報,
    /**
     * 年度
     */
    年度,
    /**
     * 転入保留特定住所一覧情報
     */
    転入保留特定住所一覧情報,
    /**
     * その他機関選択ガイド_モード
     */
    その他機関選択ガイド_モード,
    /**
     * 地区コード
     */
    地区コード,
    /**
     * 地区コード1
     */
    地区コード1,
    /**
     * 地区コード3
     */
    地区コード3,
    /**
     * 地区コード10
     */
    地区コード10,
    /**
     * 画面番号
     */
    画面番号,
    /**
     * 画面ステート
     */
    画面ステート,
    /**
     * 申請書管理番号2
     */
    申請書管理番号2,
    /**
     * 申請書管理番号3
     */
    申請書管理番号3,
    /**
     * 対象者区分
     */
    対象者区分,
    /**
     * 設定日
     */
    設定日,
    /**
     * 保険者
     */
    保険者,
    /**
     * 調査員情報
     */
    調査員情報,
    /**
     * 調査員状況02
     */
    調査員状況02,
    /**
     * 予約可否
     */
    予約可否,
    /**
     * 予約状況
     */
    予約状況,
    /**
     * 遷移元画面番号
     */
    遷移元画面番号,
    /**
     * 時間枠
     */
    時間枠,
    /**
     * 認定調査員コード
     */
    認定調査員コード,
    /**
     * 認定調査スケジュールメモ情報
     */
    認定調査スケジュールメモ情報,
    /**
     * 開催年月日
     */
    開催年月日,
    /**
     * 介護認定審査会割当委員情報
     */
    介護認定審査会割当委員情報_一覧,
    /**
     * 画面番号03
     */
    画面番号03,
    /**
     * 認定調査スケジュール登録_モード
     */
    認定調査スケジュール登録_モード,
    /**
     * 表示モード
     */
    表示モード,
    /**
     * 利用モード
     */
    利用モード,
    /**
     * 明細表示モード。
     */
    明細表示モード,
    /**
     * 選択審査会一覧。
     */
    選択審査会一覧,
    /**
     * 引き継ぎデータ
     */
    引き継ぎデータ,
    /**
     * 事業者施設選択入力ガイド_モード
     */
    事業者施設選択入力ガイド_モード,
    /**
     * 認定調査スケジュール情報
     */
    認定調査スケジュール情報,
    /**
     * 地区認定調査員情報
     */
    地区認定調査員情報,
    /**
     * 認定申請情報
     */
    認定申請情報,
    /**
     * 介護認定審査会開催予定情報
     */
    介護認定審査会開催予定情報,
    /**
     * 主治医意見書作成依頼情報
     */
    主治医意見書作成依頼情報,
    /**
     * 要介護認定申請情報
     */
    要介護認定申請情報,
    /**
     * 意見書情報
     */
    意見書情報,
    /**
     * イメージ情報
     */
    イメージ情報,
    /**
     * 地区市町村情報
     */
    地区市町村情報,
    /**
     * 保険者番号
     */
    保険者番号,
    /**
     * 要介護認定主治医意見書情報
     */
    要介護認定主治医意見書情報,
    /**
     * 一次判定結果_一次判定結果
     */
    一次判定結果,
    /**
     * 一次判定結果_一次判定結果情報
     */
    一次判定結果情報,
    /**
     * 老齢福祉年金情報_老齢福祉年金情報検索結果一覧。
     */
    老齢福祉年金情報検索結果一覧,
    /**
     * 事業者登録情報。
     */
    事業者登録情報,
    /**
     * サービス一覧情報。
     */
    サービス一覧情報,
    /**
     * 事業者登録_画面状態。
     */
    画面状態,
    /**
     * 事業者登録_事業者種類コード。
     */
    事業者種類コード,
    /**
     * 事業者登録_有効開始日。
     */
    有効開始日,
    /**
     * サービス登録_サービス種類コード。
     */
    サービス種類コード,
    /**
     * 他住所地特例。
     */
    他住所地特例,
    /**
     * 保険施設入退所。
     */
    保険施設入退所,
    /**
     * サービス情報。
     */
    サービス情報,
    /**
     * 資格取得除外者一覧。
     */
    資格取得除外者一覧,
    /**
     * 適用除外者情報。
     */
    適用除外者情報,
    /**
     * 被保険者台帳情報。
     */
    被保険者台帳情報,
    /**
     * 資格変更入力。
     */
    資格変更入力,
    /**
     * 介護事業者情報。
     */
    介護事業者情報,
    /**
     * 事業者種別
     */
    事業者種別,
    /**
     * 保険施設入退所情報
     */
    保険施設入退所情報,
    /**
     * 資格得喪情報
     */
    資格得喪情報,
    /**
     * 初期化時医療保険情報
     */
    初期化時医療保険情報,
    /**
     * 初期化時老福年金情報
     */
    初期化時老福年金情報,
    /**
     * 証交付回収情報
     */
    証交付回収情報,
    /**
     * 証交付回収情報_被保番号
     */
    証交付回収情報_被保番号,
    /**
     * 認定調査スケジュール登録10_画面項目。
     */
    認定調査スケジュール登録10_画面項目,
    /**
     * 認定調査スケジュール登録10_対象者をクリアする表示。
     */
    認定調査スケジュール登録10_対象者をクリアする表示,
    /**
     * 認定調査スケジュール登録10_対象者を検索するモード。
     */
    認定調査スケジュール登録10_対象者を検索するモード,
    /**
     * 認定調査スケジュール登録10_対象者を検索。
     */
    認定調査スケジュール登録10_対象者を検索,
    /**
     * 認定調査スケジュール登録10_対象者をクリアする状態。
     */
    認定調査スケジュール登録10_対象者をクリアする状態,
    /**
     * 住宅改修内容一覧_検索結果
     */
    住宅改修内容一覧_検索結果,
    /**
     * 資格喪失異動_識別コード
     */
    資格喪失異動_識別コード,
    /**
     * 資格取得異動_識別コード
     */
    資格取得異動_識別コード,
    /**
     * 資格取得異動_状態_被保履歴タブ
     */
    資格取得異動_状態_被保履歴タブ,
    /**
     * 資格取得異動_状態_医療保険タブ
     */
    資格取得異動_状態_医療保険タブ,
    /**
     * 資格取得異動_状態_老福年金タブ
     */
    資格取得異動_状態_老福年金タブ,
    /**
     * 資格取得異動_状態_施設入退所タブ
     */
    資格取得異動_状態_施設入退所タブ,
    /**
     * 資格喪失異動_状態_被保履歴タブ
     */
    資格喪失異動_状態_被保履歴タブ,
    /**
     * 資格喪失異動_状態_医療保険タブ
     */
    資格喪失異動_状態_医療保険タブ,
    /**
     * 資格喪失異動_状態_老福年金タブ
     */
    資格喪失異動_状態_老福年金タブ,
    /**
     * 資格喪失異動_状態_施設入退所タブ
     */
    資格喪失異動_状態_施設入退所タブ,
    /**
     * 資格喪失異動_状態_証類状況タブ
     */
    資格喪失異動_状態_証類状況タブ,
    /**
     * 要介護認定申請モニタリストフラグ
     */
    要介護認定申請モニタリストフラグ,
    /**
     * 要支援認定等申請者一覧フラグ
     */
    要支援認定等申請者一覧フラグ,
    /**
     * 認定調査予定未定者一覧フラグ
     */
    認定調査予定未定者一覧フラグ,
    /**
     * 認定調査依頼先変更者一覧表フラグ
     */
    認定調査依頼先変更者一覧表フラグ,
    /**
     * 認定調査結果と主治医意見書のチェックリストフラグ
     */
    認定調査結果と主治医意見書のチェックリストフラグ,
    /**
     * 主治医意見書未提出者一覧フラグ
     */
    主治医意見書未提出者一覧フラグ,
    /**
     * 主治医意見書５項目確認一覧表フラグ
     */
    主治医意見書５項目確認一覧表フラグ,
    /**
     * 主治医意見書依頼未処理者一覧表フラグ
     */
    主治医意見書依頼未処理者一覧表フラグ,
    /**
     * 主治医意見書作成依頼変更者一覧表フラグ
     */
    主治医意見書作成依頼変更者一覧表フラグ,
    /**
     * 主治医意見書依頼済み一覧表フラグ
     */
    主治医意見書依頼済み一覧表フラグ,
    /**
     * 主治医意見書作成料請求一覧表フラグ
     */
    主治医意見書作成料請求一覧表フラグ,
    /**
     * 主治医意見書依頼_申請書管理番号List
     */
    申請書管理番号List,
    /**
     * 資格不整合_整合性チェックの情報_宛名
     */
    整合性チェックの情報_宛名,
    /**
     * 整資格不整合_不整合修正中
     */
    不整合修正中,
    /**
     * 整資格不整合_現在の資格の情報
     */
    現在の資格の情報,
    /**
     * 整資格不整合_修正後の資格の情報
     */
    修正後の資格の情報,
    /**
     * 整資格不整合_現在の他特の情報
     */
    現在の他特の情報,
    /**
     * 整資格不整合_修正後の他特の情報
     */
    修正後の他特の情報,
    /**
     * 整資格不整合_現在の除外の情報
     */
    現在の除外の情報,
    /**
     * 整資格不整合_修正後の除外の情報
     */
    修正後の除外の情報,
    /**
     * 整資格不整合_不整合理由
     */
    不整合理由,
    /**
     * 整資格不整合_台帳状態
     */
    台帳状態,
    /**
     * 整資格不整合_個人情報
     */
    個人情報,
    /**
     * 整資格不整合_取得除外の情報
     */
    取得除外の情報,
    /**
     * 帳票制御共通
     */
    帳票制御共通,
    /**
     * その他機関マスタ検索結果
     */
    その他機関マスタ検索結果,
    /**
     * 初期の概況特記
     */
    初期の概況特記;
}
