/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.enumeratedtype.configkeys;

/**
 * 支払方法変更を表す列挙体です。
 *
 * @author N8187 久保田 英男
 */
public enum ConfigKeysShiharaiHohoHenko {

    /**
     * コンフィグキーが「支払方法変更_証表示支払方法_終了分記載区分」であることを表します。
     */
    支払方法変更_証表示支払方法_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_証表示支払方法_記載文言」であることを表します。
     */
    支払方法変更_証表示支払方法_記載文言,
    /**
     * コンフィグキーが「支払方法変更_証表示差止_終了分記載区分」であることを表します。
     */
    支払方法変更_証表示差止_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_証表示差止_記載文言」であることを表します。
     */
    支払方法変更_証表示差止_記載文言,
    /**
     * コンフィグキーが「支払方法変更_証表示減額_終了分記載区分」であることを表します。
     */
    支払方法変更_証表示減額_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_証表示減額_記載文言」であることを表します。
     */
    支払方法変更_証表示減額_記載文言,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示支払方法_終了分記載区分」であることを表します。
     */
    支払方法変更_資格者証表示支払方法_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示支払方法_記載文言」であることを表します。
     */
    支払方法変更_資格者証表示支払方法_記載文言,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示差止_終了分記載区分」であることを表します。
     */
    支払方法変更_資格者証表示差止_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示差止_記載文言」であることを表します。
     */
    支払方法変更_資格者証表示差止_記載文言,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示減額_終了分記載区分」であることを表します。
     */
    支払方法変更_資格者証表示減額_終了分記載区分,
    /**
     * コンフィグキーが「支払方法変更_資格者証表示減額_記載文言」であることを表します。
     */
    支払方法変更_資格者証表示減額_記載文言;

}
