/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbc.divcontroller.viewbox;

/**
 * 償還払い状況照会_サービス提供証明書画面のViewStateKeys
 *
 * @reamsid_L DBC-9999-022 cuilin
 */
public enum ViewStateKeys {

    /**
     * キーが「基本情報パラメータ」であることを表します
     */
    基本情報パラメータ,
    /**
     * キーが「状態」であることを表します
     */
    状態,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「様式番号」であることを表します
     */
    様式番号,
    /**
     * キーが「申請日」であることを表します
     */
    申請日,
    /**
     * キーが「サービス年月」であることを表します
     */
    サービス年月,
    /**
     * キーが「決定日」であることを表します
     */
    決定日,
    /**
     * キーが「償還払費申請検索キー」であることを表します
     */
    償還払費申請検索キー,
    /**
     * キーが「識別番号検索キー」であることを表します
     */
    識別番号検索キー,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「整理番号」であることを表します
     */
    整理番号,
    /**
     * キーが「処理モード」であることを表します
     */
    処理モード,
    /**
     * キーが「償還払費申請明細検索キー」であることを表します
     */
    償還払費申請明細検索キー,
    /**
     * キーが「事業者番号」であることを表します
     */
    事業者番号,
    /**
     * キーが「給付率」であることを表します
     */
    給付率,
    /**
     * キーが「支給申請情報検索キー」であることを表します
     */
    支給申請情報検索キー,
    /**
     * キーが「償還払請求特定診療費データ」であることを表します
     */
    償還払請求特定診療費データ,
    /**
     * キーが「償還払請求特定診療費_特別療養費一覧」であることを表します
     */
    償還払請求特定診療費_特別療養費一覧,
    /**
     * キーが「償還払請求所定疾患施設療養費等データ」であることを表します
     */
    償還払請求所定疾患施設療養費等データ,
    /**
     * キーが「住宅改修データ」であることを表します
     */
    住宅改修データ,
    /**
     * キーが「限度額リセット値」であることを表します
     */
    限度額リセット値,
    /**
     * キーが「住宅改修内容一覧_検索結果」であることを表します
     */
    住宅改修内容一覧_検索結果,
    /**
     * キーが「償還払請求緊急時施設療養」であることを表します
     */
    償還払請求緊急時施設療養,
    /**
     * キーが「証明書」であることを表します
     */
    証明書,
    /**
     * キーが「情報」であることを表します
     */
    情報,
    /**
     * キーが「サービス種類集計情報」であることを表します
     */
    サービス種類集計情報,
    /**
     * キーが「画面モード」であることを表します
     */
    画面モード,
    /**
     * キーが「福祉審査_決定」であることを表します
     */
    福祉審査_決定,
    /**
     * キーが「給付費明細登録」であることを表します
     */
    給付費明細登録,
    /**
     * キーが「福祉用具販売費」であることを表します
     */
    福祉用具販売費,
    /**
     * キーが「福祉償還払請求基本」であることを表します
     */
    福祉償還払請求基本,
    /**
     * キーが「福祉償還払支給申請」であることを表します
     */
    福祉償還払支給申請,
    /**
     * キーが「償還払請求集計」であることを表します
     */
    福祉償還払請求集計,
    /**
     * キーが「請求額集計一覧情報」であることを表します
     */
    請求額集計一覧情報,
    /**
     * キーが「償還払い費支給申請決定_口座情報」であることを表します
     */
    償還払い費支給申請決定_口座情報,
    /**
     * キーが「償還払い費支給申請決定_サービス計画費」であることを表します
     */
    償還払い費支給申請決定_サービス計画費,
    /**
     * キーが「償還払請求特定入所者介護サービス費用データ」であることを表します
     */
    償還払請求特定入所者介護サービス費用データ,
    /**
     * キーが「明細番号」であることを表します
     */
    明細番号,
    /**
     * キーが「申請年月日」であることを表します
     */
    申請年月日,
    /**
     * キーが「償還払請求食事費用」であることを表します
     */
    償還払請求食事費用,
    /**
     * キーが「償還払請求食事費用データ」であることを表します
     */
    償還払請求食事費用データ,
    /**
     * キーが「償還払請求食事費用データ1」であることを表します
     */
    償還払請求食事費用データ1,
    /**
     * キーが「償還払支給申請詳細データ」であることを表します
     */
    償還払支給申請詳細データ,
    /**
     * キーが「受領委任契約事業者一覧データ」であることを表します
     */
    受領委任契約事業者一覧データ,
    /**
     * キーが「受領委任契約事業者詳細データ」であることを表します
     */
    受領委任契約事業者詳細データ,
    /**
     * キーが「受領委任契約事業者検索キー」であることを表します
     */
    受領委任契約事業者検索キー,
    /**
     * キーが「受領委任契約事業者検索キー」であることを表します
     */
    受領委任契約事業者検索最大件数,
    /**
     * 償還払申請一覧_モード
     */
    償還払申請一覧_モード,
    /**
     * 償還払申請一覧_被保険者番号
     */
    償還払申請一覧_被保険者番号,
    /**
     * 償還払申請一覧_サービス年月
     */
    償還払申請一覧_サービス年月,
    /**
     * 償還払申請一覧_サービス年月From
     */
    償還払申請一覧_サービス年月From,
    /**
     * 償還払申請一覧_サービス年月To
     */
    償還払申請一覧_サービス年月To,
    /**
     * 償還払申請一覧_決定日
     */
    償還払申請一覧_決定日,
    /**
     * 償還払申請一覧_申請日
     */
    償還払申請一覧_申請日,
    /**
     * 償還払申請一覧_整理番号
     */
    償還払申請一覧_整理番号,
    /**
     * 償還払申請一覧_事業者番号
     */
    償還払申請一覧_事業者番号,
    /**
     * 償還払申請一覧_明細番号
     */
    償還払申請一覧_明細番号,
    /**
     * 償還払申請一覧_様式番号
     */
    償還払申請一覧_様式番号,
    /**
     * 償還払申請一覧_履歴番号
     */
    償還払申請一覧_履歴番号,
    /**
     * キーが「資格対象者」であることを表します
     */
    資格対象者,
    /**
     * キーが「処理年月」であることを表します
     */
    処理年月,
    /**
     * キーが「再処理区分」であることを表します
     */
    再処理区分,
    /**
     * 契約事業者番号
     */
    契約事業者番号,
    /**
     * 契約事業者名
     */
    契約事業者名,
    /**
     * 契約サービス種類
     */
    契約サービス種類,
    /**
     * 被保険者名
     */
    被保険者名,
    /**
     * 契約者一覧情報
     */
    契約者一覧情報,
    /**
     * 契約者一覧情報キー
     */
    契約者一覧検索キー,
    /**
     * 受領委任契約契約者詳細データ
     */
    受領委任契約契約者詳細データ,
    /**
     * 給付費明細住特
     */
    給付費明細住特,
    /**
     * キーが「サービス提供年月」であることを表します
     */
    サービス提供年月,
    /**
     * キーが「表示モード」であることを表します
     */
    表示モード,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「支払金額合計」であることを表します
     */
    支払金額合計,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「増減理由」であることを表します
     */
    増減理由,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「増減単位」であることを表します
     */
    増減単位,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「支給区分」であることを表します
     */
    支給区分,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「fuSyikyuriyu1」であることを表します
     */
    fuSyikyuriyu1,
    /**
     * 福祉用具購入費支給申請_決定情報登録 キーが「fuSyikyuriyu2」であることを表します
     */
    fuSyikyuriyu2,
    /**
     * 申請一覧検索キー
     */
    申請一覧検索キー,
    /**
     * キーが「様式番号」であることを表します
     */
    様式番号List,
    /**
     * 住宅改修費支給申請_償還払決定情報登録 キーが「連番」であることを表します
     */
    連番,
    /**
     * 退避用支給申請日（FROM)
     */
    支給申請日_FROM,
    /**
     * 退避支給申請日（TO)
     */
    支給申請日_TO,
    /**
     * 支給申請情報
     */
    支給申請情報,
    /**
     * 福祉用具購入費支給申請_明細登録画面データ
     */
    福祉用具購入費支給申請_明細登録画面データ,
    /**
     * 住宅改修費支給申請_償還払決定情報登録画面データ
     */
    住宅改修費支給申請_償還払決定情報登録画面データ,
    /**
     * 住宅改修費支給申請一括審査_決定_申請一覧
     */
    住宅改修費支給申請一括審査_決定_申請一覧,
    /**
     * 検索情報キー
     */
    検索情報キー,
    /**
     * 償還払決定一覧情報
     */
    償還払決定一覧情報,
    /**
     * 様式名称_様式コード
     */
    様式名称_様式コード,
    /**
     * 決定情報登録_決定情報
     */
    決定情報登録_決定情報,
    /**
     * 決定情報登録_償還払決定一覧
     */
    決定情報登録_償還払決定一覧,
    /**
     * 市町村判定
     */
    市町村判定,
    /**
     * 提供年月From
     */
    提供年月From,
    /**
     * 提供年月To
     */
    提供年月To,
    /**
     * 申請年月From
     */
    申請年月From,
    /**
     * 申請年月To
     */
    申請年月To,
    /**
     * 決定年月From
     */
    決定年月From,
    /**
     * 決定年月To
     */
    決定年月To,
    /**
     * 提供年月
     */
    提供年月,
    /**
     * 申請年月
     */
    申請年月,
    /**
     * 決定年月
     */
    決定年月,
    /**
     * 画面フラグ
     */
    画面フラグ,
    /**
     * ラジオ_指定
     */
    ラジオ_指定,
    /**
     * 該当者一覧キー
     */
    該当者一覧キー,
    /**
     * 住宅改修費_申請情報
     */
    住宅改修費_申請情報;

}
