/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbc.divcontroller.viewbox;

/**
 * 償還払い状況照会_サービス提供証明書画面のViewStateKeys
 */
public enum ViewStateKeys {

    /**
     * キーが「基本情報パラメータ」であることを表します
     */
    基本情報パラメータ,
    /**
     * キーが「状態」であることを表します
     */
    状態,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「様式番号」であることを表します
     */
    様式番号,
    /**
     * キーが「申請日」であることを表します
     */
    申請日,
    /**
     * キーが「サービス年月」であることを表します
     */
    サービス年月,
    /**
     * キーが「決定日」であることを表します
     */
    決定日,
    /**
     * キーが「償還払費申請検索キー」であることを表します
     */
    償還払費申請検索キー,
    /**
     * キーが「識別番号検索キー」であることを表します
     */
    識別番号検索キー,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「整理番号」であることを表します
     */
    整理番号,
    /**
     * キーが「処理モード」であることを表します
     */
    処理モード,
    /**
     * キーが「償還払費申請明細検索キー」であることを表します
     */
    償還払費申請明細検索キー,
    /**
     * キーが「事業者番号」であることを表します
     */
    事業者番号,
    /**
     * キーが「給付率」であることを表します
     */
    給付率,
    /**
     * キーが「支給申請情報検索キー」であることを表します
     */
    支給申請情報検索キー,
    /**
     * キーが「償還払請求特定診療費データ」であることを表します
     */
    償還払請求特定診療費データ,
    /**
     * キーが「償還払請求特定診療費_特別療養費一覧」であることを表します
     */
    償還払請求特定診療費_特別療養費一覧,
    /**
     * キーが「償還払請求所定疾患施設療養費等データ」であることを表します
     */
    償還払請求所定疾患施設療養費等データ,
    /**
     * キーが「償還払請求緊急時施設療養」であることを表します
     */
    償還払請求緊急時施設療養,
    /**
     * キーが「証明書」であることを表します
     */
    証明書,
    /**
     * キーが「情報」であることを表します
     */
    情報,
    /**
     * キーが「サービス種類集計情報」であることを表します
     */
    サービス種類集計情報,
    /**
     * キーが「画面モード」であることを表します
     */
    画面モード,
    /**
     * キーが「福祉審査_決定」であることを表します
     */
    福祉審査_決定,
    /**
     * キーが「給付費明細登録」であることを表します
     */
    給付費明細登録,
    /**
     * キーが「請求額集計一覧情報」であることを表します
     */
    請求額集計一覧情報,
    /**
     * キーが「償還払い費支給申請決定_口座情報」であることを表します
     */
    償還払い費支給申請決定_口座情報,
    /**
     * キーが「償還払い費支給申請決定_サービス計画費」であることを表します
     */
    償還払い費支給申請決定_サービス計画費,
    /**
     * キーが「償還払請求特定入所者介護サービス費用データ」であることを表します
     */
    償還払請求特定入所者介護サービス費用データ,
    /**
     * キーが「明細番号」であることを表します
     */
    明細番号,
    /**
     * キーが「申請年月日」であることを表します
     */
    申請年月日,
    /**
     * キーが「償還払請求食事費用」であることを表します
     */
    償還払請求食事費用,
    /**
     * キーが「償還払請求食事費用データ」であることを表します
     */
    償還払請求食事費用データ,
    /**
     * キーが「償還払請求食事費用データ1」であることを表します
     */
    償還払請求食事費用データ1,
    /**
     * キーが「償還払支給申請詳細データ」であることを表します
     */
    償還払支給申請詳細データ,
    /**
     * キーが「償還払請求基本データ」であることを表します
     */
    償還払請求基本データ,
    /**
     * キーが「受領委任契約事業者一覧データ」であることを表します
     */
    受領委任契約事業者一覧データ,
    /**
     * キーが「受領委任契約事業者詳細データ」であることを表します
     */
    受領委任契約事業者詳細データ,
    /**
     * キーが「処理年月」であることを表します
     */
    処理年月,
    /**
     * キーが「再処理区分」であることを表します
     */
    再処理区分,
    /**
     * 契約事業者番号
     */
    契約事業者番号,
    /**
     * 契約事業者名
     */
    契約事業者名,
    /**
     * 契約サービス種類
     */
    契約サービス種類,
    /**
     * 被保険者名
     */
    被保険者名,
    /**
     * 契約者一覧情報
     */
    契約者一覧情報,
    /**
     * 契約者一覧情報キー
     */
    契約者一覧情報キー;
}
