/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.divcontroller.viewbox;

/**
 * ViewStateKeys
 */
public enum ViewStateKeys {

    /**
     * キーが「認定調査スケジュール登録_地区コード」であることを表します。
     */
    認定調査スケジュール登録_地区コード,
    /**
     * キーが「認定調査スケジュール登録_地区コード1」であることを表します。
     */
    認定調査スケジュール登録_地区コード1,
    /**
     * キーが「認定調査スケジュール登録_地区コード3」であることを表します。
     */
    認定調査スケジュール登録_地区コード3,
    /**
     * キーが「認定調査スケジュール登録_地区コード10」であることを表します。
     */
    認定調査スケジュール登録_地区コード10,
    /**
     * キーが「認定調査スケジュール登録_画面番号」であることを表します。
     */
    認定調査スケジュール登録_画面番号,
    /**
     * キーが「認定調査スケジュール登録_画面ステート」であることを表します。
     */
    認定調査スケジュール登録_画面ステート,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号2」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号2,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号3」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号3,
    /**
     * キーが「認定調査スケジュール登録_対象者区分」であることを表します。
     */
    認定調査スケジュール登録_対象者区分,
    /**
     * キーが「認定調査スケジュール登録_設定日」であることを表します。
     */
    認定調査スケジュール登録_設定日,
    /**
     * キーが「認定調査スケジュール登録_保険者」であることを表します。
     */
    認定調査スケジュール登録_保険者,
    /**
     * キーが「認定調査スケジュール登録_調査員状況02」であることを表します。
     */
    認定調査スケジュール登録_調査員状況02,
    /**
     * キーが「認定調査スケジュール登録_認定調査委託先コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査委託先コード,
    /**
     * キーが「認定調査スケジュール登録_遷移元画面番号」であることを表します。
     */
    認定調査スケジュール登録_遷移元画面番号,
    /**
     * キーが「認定調査スケジュール登録_時間枠」であることを表します。
     */
    認定調査スケジュール登録_時間枠,
    /**
     * キーが「認定調査スケジュール登録_認定調査員コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査員コード,
    /**
     * 認定調査スケジュールメモ情報。
     */
    認定調査スケジュール登録_認定調査スケジュールメモ情報,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催番号,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催年月日,
    /**
     * 介護認定審査会割当委員情報。
     */
    介護認定審査会割当委員情報_一覧,
    /**
     * 状態
     */
    状態,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_画面番号03,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_モード,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    モード,
    /**
     * 施設入退所履歴_識別コード。
     */
    施設入退所履歴_識別コード,
    /**
     * 各種申請書発行_引き継ぎデータ
     */
    各種申請書発行_引き継ぎデータ,
    /**
     * 構成市町村選択_引き継ぎデータ
     */
    構成市町村選択_引き継ぎデータ;
}
