/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.divcontroller.viewbox;

/**
 * ViewStateKeys
 */
public enum ViewStateKeys {

    /**
     * キーが「認定調査スケジュール登録_地区コード」であることを表します。
     */
    認定調査スケジュール登録_地区コード,
    /**
     * キーが「認定調査スケジュール登録_地区コード1」であることを表します。
     */
    認定調査スケジュール登録_地区コード1,
    /**
     * キーが「認定調査スケジュール登録_地区コード3」であることを表します。
     */
    認定調査スケジュール登録_地区コード3,
    /**
     * キーが「認定調査スケジュール登録_地区コード10」であることを表します。
     */
    認定調査スケジュール登録_地区コード10,
    /**
     * キーが「認定調査スケジュール登録_画面番号」であることを表します。
     */
    認定調査スケジュール登録_画面番号,
    /**
     * キーが「認定調査スケジュール登録_画面ステート」であることを表します。
     */
    認定調査スケジュール登録_画面ステート,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号2」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号2,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号3」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号3,
    /**
     * キーが「認定調査スケジュール登録_対象者区分」であることを表します。
     */
    認定調査スケジュール登録_対象者区分,
    /**
     * キーが「認定調査スケジュール登録_設定日」であることを表します。
     */
    認定調査スケジュール登録_設定日,
    /**
     * キーが「認定調査スケジュール登録_保険者」であることを表します。
     */
    認定調査スケジュール登録_保険者,
    /**
     * キーが「認定調査スケジュール登録_調査員状況02」であることを表します。
     */
    認定調査スケジュール登録_調査員状況02,
    /**
     * キーが「認定調査スケジュール登録_予約可否」であることを表します。
     */
    認定調査スケジュール登録_予約可否,
    /**
     * キーが「認定調査スケジュール登録_予約状況」であることを表します。
     */
    認定調査スケジュール登録_予約状況,
    /**
     * キーが「認定調査スケジュール登録_予約状況」であることを表します。
     */
    認定調査スケジュール登録_市町村コード,
    /**
     * キーが「認定調査スケジュール登録_認定調査委託先コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査委託先コード,
    /**
     * キーが「認定調査スケジュール登録_遷移元画面番号」であることを表します。
     */
    認定調査スケジュール登録_遷移元画面番号,
    /**
     * キーが「認定調査スケジュール登録_時間枠」であることを表します。
     */
    認定調査スケジュール登録_時間枠,
    /**
     * キーが「認定調査スケジュール登録_認定調査員コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査員コード,
    /**
     * 認定調査スケジュールメモ情報。
     */
    認定調査スケジュール登録_認定調査スケジュールメモ情報,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催番号,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催年月日,
    /**
     * 介護認定審査会割当委員情報。
     */
    介護認定審査会割当委員情報_一覧,
    /**
     * 状態
     */
    状態,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_画面番号03,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_モード,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    モード,
    /**
     * 施設入退所履歴_識別コード。
     */
    施設入退所履歴_識別コード,
    /**
     * 介護認定審査会共有一覧_開催番号。
     */
    介護認定審査会共有一覧_開催番号,
    /**
     * 各種申請書発行_引き継ぎデータ
     */
    各種申請書発行_引き継ぎデータ,
    /**
     * 構成市町村選択_引き継ぎデータ
     */
    構成市町村選択_引き継ぎデータ,
    /**
     * 境界層該当者台帳管理_状態
     */
    境界層該当者台帳管理_状態,
    /**
     * 境界層該当者台帳管理_識別コード
     */
    境界層該当者台帳管理_識別コード,
    /**
     * 境界層該当者台帳管理_被保険者番号
     */
    境界層該当者台帳管理_被保険者番号,
    /**
     * 境界層該当者台帳管理_境界層該当者情報
     */
    境界層該当者台帳管理_境界層該当者情報,
    /**
     * 境界層該当者台帳管理_境界層措置申請情報
     */
    境界層該当者台帳管理_境界層措置申請情報,
    /**
     * 境界層該当者台帳管理_境界層保険料段階情報
     */
    境界層該当者台帳管理_境界層保険料段階情報,
    /**
     * 事業者・施設選択入力ガイド。
     */
    事業者施設選択入力ガイド_モード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_地区コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_市町村コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_認定調査委託先コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_認定調査員コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_設定日,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_時間枠,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_予約可否,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_予約状況,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_申請書管理番号3,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_対象者区分,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_保険者,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_調査員状況02,
    /**
     * その他機関選択ガイド_モード。
     */
    その他機関選択ガイド_モード,
    /**
     * 認定調査スケジュール登録6_認定調査スケジュール情報
     */
    認定調査スケジュール登録6_認定調査スケジュール情報,
}
