/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.divcontroller.viewbox;

/**
 * ViewStateKeys
 *
 * @reamsid_L DBZ-9999-021 sunhaidi
 */
public enum ViewStateKeys {

    /**
     * 資格対象者。
     */
    資格対象者,
    /**
     * キーが「認定調査スケジュール登録_地区コード」であることを表します。
     */
    認定調査スケジュール登録_地区コード,
    /**
     * キーが「認定調査スケジュール登録_地区コード1」であることを表します。
     */
    認定調査スケジュール登録_地区コード1,
    /**
     * キーが「認定調査スケジュール登録_地区コード3」であることを表します。
     */
    認定調査スケジュール登録_地区コード3,
    /**
     * キーが「認定調査スケジュール登録_地区コード10」であることを表します。
     */
    認定調査スケジュール登録_地区コード10,
    /**
     * キーが「認定調査スケジュール登録_画面番号」であることを表します。
     */
    認定調査スケジュール登録_画面番号,
    /**
     * キーが「認定調査スケジュール登録_画面ステート」であることを表します。
     */
    認定調査スケジュール登録_画面ステート,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号2」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号2,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号3」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号3,
    /**
     * キーが「認定調査スケジュール登録_対象者区分」であることを表します。
     */
    認定調査スケジュール登録_対象者区分,
    /**
     * キーが「認定調査スケジュール登録_設定日」であることを表します。
     */
    認定調査スケジュール登録_設定日,
    /**
     * キーが「認定調査スケジュール登録_保険者」であることを表します。
     */
    認定調査スケジュール登録_保険者,
    /**
     * キーが「認定調査スケジュール登録_調査員情報」であることを表します。
     */
    認定調査スケジュール登録_調査員情報,
    /**
     * キーが「認定調査スケジュール登録_調査員状況02」であることを表します。
     */
    認定調査スケジュール登録_調査員状況02,
    /**
     * キーが「認定調査スケジュール登録_予約可否」であることを表します。
     */
    認定調査スケジュール登録_予約可否,
    /**
     * キーが「認定調査スケジュール登録_予約状況」であることを表します。
     */
    認定調査スケジュール登録_予約状況,
    /**
     * キーが「認定調査スケジュール登録_予約状況」であることを表します。
     */
    認定調査スケジュール登録_市町村コード,
    /**
     * キーが「認定調査スケジュール登録_認定調査委託先コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査委託先コード,
    /**
     * キーが「認定調査スケジュール登録_遷移元画面番号」であることを表します。
     */
    認定調査スケジュール登録_遷移元画面番号,
    /**
     * キーが「認定調査スケジュール登録_時間枠」であることを表します。
     */
    認定調査スケジュール登録_時間枠,
    /**
     * キーが「認定調査スケジュール登録_認定調査員コード」であることを表します。
     */
    認定調査スケジュール登録_認定調査員コード,
    /**
     * 認定調査スケジュールメモ情報。
     */
    認定調査スケジュール登録_認定調査スケジュールメモ情報,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催番号,
    /**
     * 介護認定審査会委員割付。
     */
    介護認定審査会委員割付_開催年月日,
    /**
     * 介護認定審査会割当委員情報。
     */
    介護認定審査会割当委員情報_一覧,
    /**
     * 状態
     */
    状態,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_画面番号03,
    /**
     * キーが「認定調査スケジュール登録_画面番号03」であることを表します。
     */
    認定調査スケジュール登録_モード,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    認定調査スケジュール登録_申請書管理番号,
    /**
     * キーが「認定調査スケジュール登録_申請書管理番号」であることを表します。
     */
    モード,
    /**
     * 施設入退所履歴_識別コード。
     */
    施設入退所履歴_識別コード,
    /**
     * 該当者検索_識別コード。
     */
    該当者検索_識別コード,
    /**
     * 施設入退所履歴_表示モード。
     */
    施設入退所履歴_表示モード,
    /**
     * 施設入退所履歴_利用モード。
     */
    施設入退所履歴_利用モード,
    /**
     * 施設入退所履歴_明細表示モード。
     */
    施設入退所履歴_明細表示モード,
    /**
     * 施設入退所履歴_施設入退所情報。
     */
    施設入退所履歴_施設入退所情報,
    /**
     * 介護認定審査会共有一覧_開催番号。
     */
    介護認定審査会共有一覧_開催番号,
    /**
     * 介護認定審査会共有一覧_開催番号。
     */
    介護認定審査会共有一覧_選択審査会一覧,
    /**
     * 各種申請書発行_引き継ぎデータ
     */
    各種申請書発行_引き継ぎデータ,
    /**
     * 構成市町村選択_引き継ぎデータ
     */
    構成市町村選択_引き継ぎデータ,
    /**
     * 境界層該当者台帳管理_状態
     */
    境界層該当者台帳管理_状態,
    /**
     * 境界層該当者台帳管理_識別コード
     */
    境界層該当者台帳管理_識別コード,
    /**
     * 境界層該当者台帳管理_被保険者番号
     */
    境界層該当者台帳管理_被保険者番号,
    /**
     * 境界層該当者台帳管理_境界層該当者情報
     */
    境界層該当者台帳管理_境界層該当者情報,
    /**
     * 境界層該当者台帳管理_境界層措置申請情報
     */
    境界層該当者台帳管理_境界層措置申請情報,
    /**
     * 境界層該当者台帳管理_境界層保険料段階情報
     */
    境界層該当者台帳管理_境界層保険料段階情報,
    /**
     * 事業者・施設選択入力ガイド。
     */
    事業者施設選択入力ガイド_モード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_地区コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_市町村コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_認定調査委託先コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_認定調査員コード,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_設定日,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_時間枠,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_予約可否,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_予約状況,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_申請書管理番号3,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_対象者区分,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_保険者,
    /**
     * 認定調査スケジュール登録3。
     */
    認定調査スケジュール登録3_調査員状況02,
    /**
     * その他機関選択ガイド_モード。
     */
    その他機関選択ガイド_モード,
    /**
     * 認定調査スケジュール登録6_認定調査スケジュール情報。
     */
    認定調査スケジュール登録6_認定調査スケジュール情報,
    /**
     * 認定調査スケジュール登録5。
     */
    認定調査スケジュール登録5_地区認定調査員情報,
    /**
     * 調査地区グループ調査地区一覧検索結果
     */
    調査地区グループ調査地区一覧結果,
    /**
     * 主治医マスタ検索結果
     */
    主治医マスタ検索結果,
    /**
     * 認定申請情報検索結果
     */
    検索結果_認定申請情報,
    /**
     * 介護認定審査会開催予定情報。
     */
    介護認定審査会開催予定情報,
    /**
     * 主治医意見書作成依頼_主治医意見書作成依頼情報。
     */
    主治医意見書作成依頼_主治医意見書作成依頼情報,
    /**
     * 主治医意見書作成依頼_要介護認定申請情報。
     */
    主治医意見書作成依頼_要介護認定申請情報,
    /**
     * 主治医意見書作成依頼_被保険者番号。
     */
    主治医意見書作成依頼_被保険者番号,
    /**
     * 要介護認定申請検索_申請書管理番号。
     */
    要介護認定申請検索_申請書管理番号,
    /**
     * 要介護認定申請検索_被保険者番号。
     */
    要介護認定申請検索_被保険者番号,
    /**
     * 要介護認定申請検索_証記載保険者番号。
     */
    要介護認定申請検索_証記載保険者番号,
    /**
     * 主治医意見書作成依頼_被保険者番号。
     */
    要介護認定申請検索_主治医意見書作成依頼履歴番号,
    /**
     * 主治医意見書登録_意見書情報
     */
    主治医意見書登録_意見書情報,
    /**
     * 主治医意見書登録_イメージ情報
     */
    主治医意見書登録_イメージ情報,
    /**
     * 認定調査スケジュール登録7_地区市町村情報
     */
    認定調査スケジュール登録7_地区市町村情報,
    /**
     * 申請書管理番号
     */
    申請書管理番号,
    /**
     * 被保険者番号
     */
    被保険者番号,
    /**
     * 保険者番号
     */
    保険者番号,
    /**
     * 認定調査委託先コード
     */
    認定調査委託先コード,
    /**
     * 認定調査員マスタ検索結果
     */
    認定調査員マスタ検索結果,
    /**
     * 審査会一覧_開催番号
     */
    審査会一覧_開催番号,
    /**
     * 心身の意見入力_要介護認定主治医意見書情報
     */
    心身の意見入力_要介護認定主治医意見書情報,
    /**
     * 一次判定結果_一次判定結果
     */
    一次判定結果_一次判定結果,
    /**
     * 一次判定結果_一次判定結果情報
     */
    一次判定結果_一次判定結果情報,
    /**
     * 老齢福祉年金情報_老齢福祉年金情報検索結果一覧。
     */
    老齢福祉年金情報_老齢福祉年金情報検索結果一覧,
    /**
     * 事業者登録情報。
     */
    事業者登録情報,
    /**
     * サービス一覧情報。
     */
    サービス一覧情報,
    /**
     * 事業者登録_画面状態。
     */
    事業者登録_画面状態,
    /**
     * 事業者登録_事業者番号。
     */
    事業者登録_事業者番号,
    /**
     * 事業者登録_事業者種類コード。
     */
    事業者登録_事業者種類コード,
    /**
     * 事業者登録_有効開始日。
     */
    事業者登録_有効開始日,
    /**
     * サービス登録_画面状態。
     */
    サービス登録_画面状態,
    /**
     * サービス登録_事業者番号。
     */
    サービス登録_事業者番号,
    /**
     * サービス登録_サービス種類コード。
     */
    サービス登録_サービス種類コード,
    /**
     * サービス登録_有効開始日。
     */
    サービス登録_有効開始日,
    /**
     * 他住所地特例者管理_他住所地特例。
     */
    他住所地特例者管理_他住所地特例,
    /**
     * 他住所地特例者管理_保険施設入退所。
     */
    他住所地特例者管理_保険施設入退所,
    /**
     * サービス登録_サービス情報。
     */
    サービス登録_サービス情報,
    /**
     * 資格取得除外者登録_資格取得除外者一覧。
     */
    資格取得除外者登録_資格取得除外者一覧,
    /**
     * 適用除外者管理_適用除外者情報。
     */
    適用除外者管理_適用除外者情報,
    /**
     * 資格変更履歴_被保険者台帳情報。
     */
    資格変更履歴_被保険者台帳情報,
    /**
     * 資格変更履歴_資格変更入力。
     */
    資格変更履歴_資格変更入力,
    /**
     * 介護事業者_状態。
     */
    介護事業者_状態,
    /**
     * 介護事業者_介護事業者情報。
     */
    介護事業者_介護事業者情報,
    /**
     * 介護事業者_介護事業者情報。
     */
    介護事業者_事業者種別,
    /**
     * 適用除外者管理_保険施設入退所情報。
     */
    適用除外者管理_保険施設入退所情報,
    /**
     * 資格異動の訂正_識別コード。
     */
    資格異動の訂正_識別コード,
    /**
     * 資格異動の訂正_被保番号。
     */
    資格異動の訂正_被保番号,
    /**
     * 資格異動の訂正_状態。
     */
    資格異動の訂正_状態,
    /**
     * 資格異動の訂正_資格得喪情報。
     */
    資格異動の訂正_資格得喪情報,
    /**
     * 資格異動の訂正_初期化時医療保険情報。
     */
    資格異動の訂正_初期化時医療保険情報,
    /**
     * 資格異動の訂正_初期化時老福年金情報。
     */
    資格異動の訂正_初期化時老福年金情報,
    /**
     * 証交付回収情報
     */
    証交付回収情報,
    /**
     * 証交付回収情報_被保番号
     */
    証交付回収情報_被保番号,
    /**
     * 認定調査スケジュール登録10_認定調査員コード値。
     */
    認定調査スケジュール登録10_認定調査員コード値,
    /**
     * 認定調査スケジュール登録10_認定調査員コード状態。
     */
    認定調査スケジュール登録10_認定調査員コード状態,
    /**
     * 認定調査スケジュール登録10_認定調査員氏名値。
     */
    認定調査スケジュール登録10_認定調査員氏名値,
    /**
     * 認定調査スケジュール登録10_認定調査委託先コード値。
     */
    認定調査スケジュール登録10_認定調査委託先コード値,
    /**
     * 認定調査スケジュール登録10_認定調査委託先名称値。
     */
    認定調査スケジュール登録10_認定調査委託先名称値,
    /**
     * 認定調査スケジュール登録10_調査日値。
     */
    認定調査スケジュール登録10_調査日値,
    /**
     * 認定調査スケジュール登録10_調査日時値。
     */
    認定調査スケジュール登録10_調査日時値,
    /**
     * 認定調査スケジュール登録10_時間枠値。
     */
    認定調査スケジュール登録10_時間枠値,
    /**
     * 認定調査スケジュール登録10_予約可否値。
     */
    認定調査スケジュール登録10_予約可否値,
    /**
     * 認定調査スケジュール登録10_予約可否状態。
     */
    認定調査スケジュール登録10_予約可否状態,
    /**
     * 認定調査スケジュール登録10_備考値。
     */
    認定調査スケジュール登録10_備考値,
    /**
     * 認定調査スケジュール登録10_備考状態。
     */
    認定調査スケジュール登録10_備考状態,
    /**
     * 認定調査スケジュール登録10_予約状況値。
     */
    認定調査スケジュール登録10_予約状況値,
    /**
     * 認定調査スケジュール登録10_予約状況状態。
     */
    認定調査スケジュール登録10_予約状況状態,
    /**
     * 認定調査スケジュール登録10_対象者を検索する表示。
     */
    認定調査スケジュール登録10_対象者を検索する表示,
    /**
     * 認定調査スケジュール登録10_対象者を検索する状態。
     */
    認定調査スケジュール登録10_対象者を検索する状態,
    /**
     * 認定調査スケジュール登録10_前回情報を表示する表示。
     */
    認定調査スケジュール登録10_前回情報を表示する表示,
    /**
     * 認定調査スケジュール登録10_前回情報を表示する状態。
     */
    認定調査スケジュール登録10_前回情報を表示する状態,
    /**
     * 認定調査スケジュール登録10_被保番号状態。
     */
    認定調査スケジュール登録10_被保番号状態,
    /**
     * 認定調査スケジュール登録10_場所値。
     */
    認定調査スケジュール登録10_場所値,
    /**
     * 認定調査スケジュール登録10_場所状態。
     */
    認定調査スケジュール登録10_場所状態,
    /**
     * 認定調査スケジュール登録10_駐車場値。
     */
    認定調査スケジュール登録10_駐車場値,
    /**
     * 認定調査スケジュール登録10_立会人１値。
     */
    認定調査スケジュール登録10_立会人１値,
    /**
     * 認定調査スケジュール登録10_連絡先１値。
     */
    認定調査スケジュール登録10_連絡先１値,
    /**
     * 認定調査スケジュール登録10_立会人２値。
     */
    認定調査スケジュール登録10_立会人２値,
    /**
     * 認定調査スケジュール登録10_連絡先２値。
     */
    認定調査スケジュール登録10_連絡先２値,
    /**
     * 認定調査スケジュール登録10_対象者メモ値。
     */
    認定調査スケジュール登録10_対象者メモ値,
    /**
     * 認定調査スケジュール登録10_対象者をクリアする表示。
     */
    認定調査スケジュール登録10_対象者をクリアする表示,
    /**
     * 認定調査スケジュール登録10_対象者をクリアする表示。
     */
    認定調査スケジュール登録10_対象者を検索するモード,
    /**
     * 認定調査スケジュール登録10_対象者をクリアする状態。
     */
    認定調査スケジュール登録10_対象者をクリアする状態,
    /**
     * 住宅改修内容一覧_検索結果
     */
    住宅改修内容一覧_検索結果,
    /**
     * 資格喪失異動_識別コード
     */
    資格喪失異動_識別コード,
    /**
     * 資格取得異動_識別コード
     */
    資格取得異動_識別コード,
    /**
     * 資格取得異動_状態_被保履歴タブ
     */
    資格取得異動_状態_被保履歴タブ,
    /**
     * 資格取得異動_状態_医療保険タブ
     */
    資格取得異動_状態_医療保険タブ,
    /**
     * 資格取得異動_状態_老福年金タブ
     */
    資格取得異動_状態_老福年金タブ,
    /**
     * 資格取得異動_状態_施設入退所タブ
     */
    資格取得異動_状態_施設入退所タブ,
    /**
     * 資格喪失異動_状態_被保履歴タブ
     */
    資格喪失異動_状態_被保履歴タブ,
    /**
     * 資格喪失異動_状態_医療保険タブ
     */
    資格喪失異動_状態_医療保険タブ,
    /**
     * 資格喪失異動_状態_老福年金タブ
     */
    資格喪失異動_状態_老福年金タブ,
    /**
     * 資格喪失異動_状態_施設入退所タブ
     */
    資格喪失異動_状態_施設入退所タブ,
    /**
     * 資格喪失異動_状態_証類状況タブ
     */
    資格喪失異動_状態_証類状況タブ,
    /**
     * 転入保留特定住所一覧情報
     */
    転入保留特定住所一覧情報,
    /**
     * 要介護認定申請_依頼業務照会_要介護認定申請モニタリストフラグ
     */
    要介護認定申請_依頼業務照会_要介護認定申請モニタリストフラグ,
    /**
     * 要介護認定申請_依頼業務照会_要介護認定_要支援認定等申請者一覧フラグ
     */
    要介護認定申請_依頼業務照会_要介護認定_要支援認定等申請者一覧フラグ,
    /**
     * 要介護認定申請_依頼業務照会_認定調査予定未定者一覧フラグ
     */
    要介護認定申請_依頼業務照会_認定調査予定未定者一覧フラグ,
    /**
     * 要介護認定申請_依頼業務照会_認定調査依頼先変更者一覧表フラグ
     */
    要介護認定申請_依頼業務照会_認定調査依頼先変更者一覧表フラグ,
    /**
     * 要介護認定申請_依頼業務照会_認定調査結果と主治医意見書のチェックリストフラグ
     */
    要介護認定申請_依頼業務照会_認定調査結果と主治医意見書のチェックリストフラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書未提出者一覧フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書未提出者一覧フラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書５項目確認一覧表フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書５項目確認一覧表フラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書依頼未処理者一覧表フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書依頼未処理者一覧表フラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書作成依頼変更者一覧表フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書作成依頼変更者一覧表フラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書依頼済み一覧表フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書依頼済み一覧表フラグ,
    /**
     * 要介護認定申請_依頼業務照会_主治医意見書作成料請求一覧表フラグ
     */
    要介護認定申請_依頼業務照会_主治医意見書作成料請求一覧表フラグ,
    /**
     * 転入保留対象者情報
     */
    転入転出保留対象者管理_転入保留対象者情報,
    /**
     * 転出保留対象者情報
     */
    転入転出保留対象者管理_転出保留対象者情報,
    /**
     * 主治医意見書依頼_申請書管理番号
     */
    主治医意見書依頼_申請書管理番号,
    /**
     * 主治医意見書依頼_申請書管理番号List
     */
    主治医意見書依頼_申請書管理番号List,
    /**
     * 資格不整合_整合性チェックの情報_宛名
     */
    資格不整合_整合性チェックの情報_宛名,
    /**
     * 整資格不整合_不整合修正中
     */
    資格不整合_不整合修正中,
    /**
     * 整資格不整合_現在の資格の情報
     */
    資格不整合_現在の資格の情報,
    /**
     * 整資格不整合_修正後の資格の情報
     */
    資格不整合_修正後の資格の情報,
    /**
     * 整資格不整合_現在の他特の情報
     */
    資格不整合_現在の他特の情報,
    /**
     * 整資格不整合_修正後の他特の情報
     */
    資格不整合_修正後の他特の情報,
    /**
     * 整資格不整合_現在の除外の情報
     */
    資格不整合_現在の除外の情報,
    /**
     * 整資格不整合_修正後の除外の情報
     */
    資格不整合_修正後の除外の情報,
    /**
     * 整資格不整合_不整合理由
     */
    資格不整合_不整合理由,
    /**
     * 整資格不整合_台帳状態
     */
    資格不整合_台帳状態,
    /**
     * 整資格不整合_個人情報
     */
    資格不整合_個人情報,
    /**
     * 整資格不整合_取得除外の情報
     */
    資格不整合_取得除外の情報,
    /**
     * タスク一覧
     */
    タスク一覧_要介護認定完了情報,
    /**
     * 介護認定審査会開催結果登録_開催番号
     */
    介護認定審査会開催結果登録_開催番号,
    /**
     * 介護認定審査会開催結果登録_介護認定審査会開催予定情報
     */
    介護認定審査会開催結果登録_介護認定審査会開催予定情報,
    /**
     * 介護認定審査会開催結果登録_要介護認定申請情報
     */
    介護認定審査会開催結果登録_要介護認定申請情報,
    /**
     * 介護認定審査会資料作成_開催予定日
     */
    介護認定審査会資料作成_開催予定日,
    /**
     * 介護認定審査会資料作成_審査会会場
     */
    介護認定審査会資料作成_審査会会場,
    /**
     * 介護認定審査会資料作成_開始予定時間
     */
    介護認定審査会資料作成_開始予定時間,
    /**
     * 介護認定審査会資料作成_資料作成
     */
    介護認定審査会資料作成_資料作成,
    /**
     * 介護認定審査会資料作成_合議体番号
     */
    介護認定審査会資料作成_合議体番号,
    /**
     * 介護認定審査会資料作成_合議体名称
     */
    介護認定審査会資料作成_合議体名称,
    /**
     * 介護認定審査会資料作成_予定定員
     */
    介護認定審査会資料作成_予定定員,
    /**
     * 介護認定審査会資料作成_割付人数
     */
    介護認定審査会資料作成_割付人数,
    /**
     * 介帳票分類ID
     */
    帳票分類ID,
    /**
     * 帳票分類名称
     */
    帳票分類名称,
    /**
     * 介護認定審査会資料作成_処理日
     */
    介護認定審査会資料作成_処理日;
}
