/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.config;

/**
 * 日付のコンフィグキーです。
 *
 * @author N8156 宮本 康
 */
public enum ConfigKeysHizuke {

    /**
     * コンフィグキーが「日付関連_調定年度」であることを表します。
     */
    日付関連_調定年度,
    /**
     * コンフィグキーが「日付関連_当初年度」であることを表します。
     */
    日付関連_当初年度,
    /**
     * コンフィグキーが「日付関連_遡及年度」であることを表します。
     */
    日付関連_遡及年度,
    /**
     * コンフィグキーが「日付関連_所得年度」であることを表します。
     */
    日付関連_所得年度,
    /**
     * コンフィグキーが「日付関連_月別テーブル1」であることを表します。
     */
    日付関連_月別テーブル1,
    /**
     * コンフィグキーが「日付関連_月別テーブル2」であることを表します。
     */
    日付関連_月別テーブル2,
    /**
     * コンフィグキーが「日付関連_月別テーブル3」であることを表します。
     */
    日付関連_月別テーブル3,
    /**
     * コンフィグキーが「日付関連_月別テーブル4」であることを表します。
     */
    日付関連_月別テーブル4,
    /**
     * コンフィグキーが「日付関連_月別テーブル5」であることを表します。
     */
    日付関連_月別テーブル5,
    /**
     * コンフィグキーが「日付関連_月別テーブル6」であることを表します。
     */
    日付関連_月別テーブル6,
    /**
     * コンフィグキーが「日付関連_月別テーブル7」であることを表します。
     */
    日付関連_月別テーブル7,
    /**
     * コンフィグキーが「日付関連_月別テーブル8」であることを表します。
     */
    日付関連_月別テーブル8,
    /**
     * コンフィグキーが「日付関連_月別テーブル9」であることを表します。
     */
    日付関連_月別テーブル9,
    /**
     * コンフィグキーが「日付関連_月別テーブル10」であることを表します。
     */
    日付関連_月別テーブル10,
    /**
     * コンフィグキーが「日付関連_月別テーブル11」であることを表します。
     */
    日付関連_月別テーブル11,
    /**
     * コンフィグキーが「日付関連_月別テーブル12」であることを表します。
     */
    日付関連_月別テーブル12,
    /**
     * コンフィグキーが「日付関連_月別テーブル13」であることを表します。
     */
    日付関連_月別テーブル13,
    /**
     * コンフィグキーが「日付関連_月別テーブル14」であることを表します。
     */
    日付関連_月別テーブル14;
}
