/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbe.definition.ninteichosa.enumeratedtype;

/**
 * 要介護認定調査の調査項目区分（概況調査）を表す列挙型です。
 *
 * @author N8156 宮本 康
 */
public enum NinteichosaItemKubunOfGaikyo {

    /**
     * 調査項目区分が「現在の状況コード」であることを表します。
     */
    現在の状況コード,
    /**
     * 調査項目区分が「サービス区分コード」であることを表します。
     */
    サービス区分コード,
    /**
     * 調査項目区分が「訪問介護」であることを表します。
     */
    訪問介護,
    /**
     * 調査項目区分が「訪問入浴介護」であることを表します。
     */
    訪問入浴介護,
    /**
     * 調査項目区分が「訪問看護」であることを表します。
     */
    訪問看護,
    /**
     * 調査項目区分が「訪問リハビリ」であることを表します。
     */
    訪問リハビリ,
    /**
     * 調査項目区分が「居宅療養管理指導」であることを表します。
     */
    居宅療養管理指導,
    /**
     * 調査項目区分が「通所介護」であることを表します。
     */
    通所介護,
    /**
     * 調査項目区分が「通所リハビリテーション」であることを表します。
     */
    通所リハビリテーション,
    /**
     * 調査項目区分が「短期入所生活介護」であることを表します。
     */
    短期入所生活介護,
    /**
     * 調査項目区分が「短期入所療養介護」であることを表します。
     */
    短期入所療養介護,
    /**
     * 調査項目区分が「特定施設入居者生活介護」であることを表します。
     */
    特定施設入居者生活介護,
    /**
     * 調査項目区分が「福祉用具貸与」であることを表します。
     */
    福祉用具貸与,
    /**
     * 調査項目区分が「特定福祉用具販売」であることを表します。
     */
    特定福祉用具販売,
    /**
     * 調査項目区分が「住宅改修」であることを表します。
     */
    住宅改修,
    /**
     * 調査項目区分が「夜間対応型訪問介護」であることを表します。
     */
    夜間対応型訪問介護,
    /**
     * 調査項目区分が「認知症対応型通所介護」であることを表します。
     */
    認知症対応型通所介護,
    /**
     * 調査項目区分が「小規模多機能型居宅介護」であることを表します。
     */
    小規模多機能型居宅介護,
    /**
     * 調査項目区分が「認知症対応型共同生活介護」であることを表します。
     */
    認知症対応型共同生活介護,
    /**
     * 調査項目区分が「地域密着型特定施設入居者生活介護」であることを表します。
     */
    地域密着型特定施設入居者生活介護,
    /**
     * 調査項目区分が「地域密着型介護老人福祉施設入所者生活介護」であることを表します。
     */
    地域密着型介護老人福祉施設入所者生活介護,
    /**
     * 調査項目区分が「定期巡回_随時対応型訪問介護看護」であることを表します。
     */
    定期巡回_随時対応型訪問介護看護,
    /**
     * 調査項目区分が「複合型サービス」であることを表します。
     */
    複合型サービス,
    /**
     * 調査項目区分が「市町村特別給付」であることを表します。
     */
    市町村特別給付,
    /**
     * 調査項目区分が「介護保険給付以外の在宅サービス」であることを表します。
     */
    介護保険給付以外の在宅サービス,
    /**
     * 調査項目区分が「利用施設コード」であることを表します。
     */
    利用施設コード,
    /**
     * 調査項目区分が「利用施設名」であることを表します。
     */
    利用施設名,
    /**
     * 調査項目区分が「利用施設住所」であることを表します。
     */
    利用施設住所,
    /**
     * 調査項目区分が「利用施設電話番号」であることを表します。
     */
    利用施設電話番号,
    /**
     * 調査項目区分が「利用施設郵便番号」であることを表します。
     */
    利用施設郵便番号,
    /**
     * 調査項目区分が「概況特記事項」であることを表します。
     */
    概況特記事項,
}
