/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbb.definition.enumeratedtype;

/**
 * 日付のコンフィグキーです。
 *
 * @author N8156 宮本 康
 */
public enum ConfigKeysHizuke {

    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ1」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ1,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ2」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ2,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ3」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ3,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ4」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ4,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ5」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ5,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ6」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ6,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ7」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ7,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ8」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ8,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ9」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ9,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ10」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ10,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ11」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ11,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ12」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ12,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ13」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ13,
    /**
     * コンフィグキーが「日付関連_月別ﾃｰﾌﾞﾙ14」であることを表します。
     */
    日付関連_月別ﾃｰﾌﾞﾙ14;
}
