/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbe.business.core.ninteichosadataoutput;

import jp.co.ndensan.reams.uz.uza.lang.RString;

/**
 * DbT5211テーブルの連番の列挙体クラスです。
 */
public enum DbT5211Renban {

    /**
     * * 調査項目連番01
     */
    調査項目連番01(1),
    /**
     * * 調査項目連番02
     */
    調査項目連番02(2),
    /**
     * * 調査項目連番03
     */
    調査項目連番03(3),
    /**
     * * 調査項目連番04
     */
    調査項目連番04(4),
    /**
     * * 調査項目連番05
     */
    調査項目連番05(5),
    /**
     * * 調査項目連番06
     */
    調査項目連番06(6),
    /**
     * * 調査項目連番07
     */
    調査項目連番07(7),
    /**
     * * 調査項目連番08
     */
    調査項目連番08(8),
    /**
     * * 調査項目連番09
     */
    調査項目連番09(9),
    /**
     * * 調査項目連番10
     */
    調査項目連番10(10),
    /**
     * * 調査項目連番11
     */
    調査項目連番11(11),
    /**
     * * 調査項目連番12
     */
    調査項目連番12(12),
    /**
     * * 調査項目連番13
     */
    調査項目連番13(13),
    /**
     * * 調査項目連番14
     */
    調査項目連番14(14),
    /**
     * * 調査項目連番15
     */
    調査項目連番15(15),
    /**
     * * 調査項目連番16
     */
    調査項目連番16(16),
    /**
     * * 調査項目連番17
     */
    調査項目連番17(17),
    /**
     * * 調査項目連番18
     */
    調査項目連番18(18),
    /**
     * * 調査項目連番19
     */
    調査項目連番19(19),
    /**
     * * 調査項目連番20
     */
    調査項目連番20(20),
    /**
     * * 調査項目連番21
     */
    調査項目連番21(21),
    /**
     * * 調査項目連番22
     */
    調査項目連番22(22),
    /**
     * * 調査項目連番23
     */
    調査項目連番23(23),
    /**
     * * 調査項目連番24
     */
    調査項目連番24(24),
    /**
     * * 調査項目連番25
     */
    調査項目連番25(25),
    /**
     * * 調査項目連番26
     */
    調査項目連番26(26),
    /**
     * * 調査項目連番27
     */
    調査項目連番27(27),
    /**
     * * 調査項目連番28
     */
    調査項目連番28(28),
    /**
     * * 調査項目連番29
     */
    調査項目連番29(29),
    /**
     * * 調査項目連番30
     */
    調査項目連番30(30),
    /**
     * * 調査項目連番31
     */
    調査項目連番31(31),
    /**
     * * 調査項目連番32
     */
    調査項目連番32(32),
    /**
     * * 調査項目連番33
     */
    調査項目連番33(33),
    /**
     * * 調査項目連番34
     */
    調査項目連番34(34),
    /**
     * * 調査項目連番35
     */
    調査項目連番35(35),
    /**
     * * 調査項目連番36
     */
    調査項目連番36(36),
    /**
     * * 調査項目連番37
     */
    調査項目連番37(37),
    /**
     * * 調査項目連番38
     */
    調査項目連番38(38),
    /**
     * * 調査項目連番39
     */
    調査項目連番39(39),
    /**
     * * 調査項目連番40
     */
    調査項目連番40(40),
    /**
     * * 調査項目連番41
     */
    調査項目連番41(41),
    /**
     * * 調査項目連番42
     */
    調査項目連番42(42),
    /**
     * * 調査項目連番43
     */
    調査項目連番43(43),
    /**
     * * 調査項目連番44
     */
    調査項目連番44(44),
    /**
     * * 調査項目連番45
     */
    調査項目連番45(45),
    /**
     * * 調査項目連番46
     */
    調査項目連番46(46),
    /**
     * * 調査項目連番47
     */
    調査項目連番47(47),
    /**
     * * 調査項目連番48
     */
    調査項目連番48(48),
    /**
     * * 調査項目連番49
     */
    調査項目連番49(49),
    /**
     * * 調査項目連番50
     */
    調査項目連番50(50),
    /**
     * * 調査項目連番51
     */
    調査項目連番51(51),
    /**
     * * 調査項目連番52
     */
    調査項目連番52(52),
    /**
     * * 調査項目連番53
     */
    調査項目連番53(53),
    /**
     * * 調査項目連番54
     */
    調査項目連番54(54),
    /**
     * * 調査項目連番55
     */
    調査項目連番55(55),
    /**
     * * 調査項目連番56
     */
    調査項目連番56(56),
    /**
     * * 調査項目連番57
     */
    調査項目連番57(57),
    /**
     * * 調査項目連番58
     */
    調査項目連番58(58),
    /**
     * * 調査項目連番59
     */
    調査項目連番59(59),
    /**
     * * 調査項目連番60
     */
    調査項目連番60(60),
    /**
     * * 調査項目連番61
     */
    調査項目連番61(61),
    /**
     * * 調査項目連番62
     */
    調査項目連番62(62),
    /**
     * * 調査項目連番63
     */
    調査項目連番63(63),
    /**
     * * 調査項目連番64
     */
    調査項目連番64(64),
    /**
     * * 調査項目連番65
     */
    調査項目連番65(65),
    /**
     * * 調査項目連番66
     */
    調査項目連番66(66),
    /**
     * * 調査項目連番67
     */
    調査項目連番67(67),
    /**
     * * 調査項目連番68
     */
    調査項目連番68(68),
    /**
     * * 調査項目連番69
     */
    調査項目連番69(69),
    /**
     * * 調査項目連番70
     */
    調査項目連番70(70),
    /**
     * * 調査項目連番71
     */
    調査項目連番71(71),
    /**
     * * 調査項目連番72
     */
    調査項目連番72(72),
    /**
     * * 調査項目連番73
     */
    調査項目連番73(73),
    /**
     * * 調査項目連番74
     */
    調査項目連番74(74);

    private final int renban;

    private DbT5211Renban(int renban) {
        this.renban = renban;
    }

    /**
     * 連番を取得します。
     *
     * @return 連番
     */
    public RString get連番() {
        return new RString(renban);
    }
}
