/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.core;

/**
 * ViewStateKeys
 */
public enum ViewStateKeys {

    /**
     * 台帳種別表示
     */
    台帳種別表示,
    /**
     * 被保険者
     */
    被保険者,
    /**
     * 他市町村住所地特例者
     */
    他市町村住所地特例者,
    /**
     * 適用除外者
     */
    適用除外者,
    /**
     * モード
     */
    モード,
    /**
     * 介護認定審査会委員情報
     */
    介護認定審査会委員情報,
    /**
     * 介護認定審査会委員情報更新
     */
    介護認定審査会委員情報更新,
    /**
     * 開催場所情報一覧
     */
    開催場所情報一覧,
    /**
     * 状態
     */
    状態,
    /**
     * 被保険者番号
     */
    被保険者番号,
    /**
     * 医療保険情報
     */
    医療保険情報,
    /**
     * 医療保険情報_モード
     */
    医療保険情報_モード,
    /**
     * 医療保険情報_識別コード
     */
    医療保険情報_識別コード,
    /**
     * 医療保険情報_市町村コード
     */
    医療保険情報_市町村コード,
    /**
     * 識別コード
     */
    識別コード,
    /**
     * 審査請求届出日
     */
    審査請求届出日,
    /**
     * 決定情報
     */
    決定情報,
    /**
     * 償還払決定一覧_業務区分
     */
    償還払決定一覧_業務区分,
    /**
     * 償還払決定一覧_モード
     */
    償還払決定一覧_モード,
    /**
     * 償還払決定一覧_被保険者番号
     */
    償還払決定一覧_被保険者番号,
    /**
     * 償還払決定一覧_サービス提供年月
     */
    償還払決定一覧_サービス提供年月,
    /**
     * 償還払決定一覧_整理番号
     */
    償還払決定一覧_整理番号,
    /**
     * 償還払決定一覧_支払金額合計
     */
    償還払決定一覧_支払金額合計,
    /**
     * 不服審査申立情報
     */
    不服審査申立情報,
    /**
     * 支給申請情報パラメータ
     */
    支給申請情報パラメータ,
    /**
     * 業務内区分コード
     */
    業務内区分コード,
    /**
     * 償還払申請一覧
     */
    償還払申請一覧,
    /**
     * 償還払申請一覧_モード
     */
    償還払申請一覧_モード,
    /**
     * 償還払申請一覧_被保険者番号
     */
    償還払申請一覧_被保険者番号,
    /**
     * 償還払申請一覧_サービス年月
     */
    償還払申請一覧_サービス年月,
    /**
     * 償還払申請一覧_サービス年月From
     */
    償還払申請一覧_サービス年月From,
    /**
     * 償還払申請一覧_サービス年月To
     */
    償還払申請一覧_サービス年月To,
    /**
     * 償還払申請一覧_整理番号
     */
    償還払申請一覧_整理番号,
    /**
     * 償還払申請一覧_様式番号
     */
    償還払申請一覧_様式番号,
    /**
     * 償還払申請一覧_履歴番号
     */
    償還払申請一覧_履歴番号,
    /**
     * 老人保健受給者台帳管理_識別コード
     */
    老人保健受給者台帳管理_識別コード,
    /**
     * 老人保健受給者台帳管理_被保険者番号
     */
    老人保健受給者台帳管理_被保険者番号,
    /**
     * 老人保健受給者台帳管理_モード
     */
    老人保健受給者台帳管理_モード,
    /**
     * 老健受給情報
     */
    老健受給情報,
    /**
     * 住宅改修内容一覧_被保険者番号
     */
    住宅改修内容一覧_被保険者番号,
    /**
     * 住宅改修内容一覧_サービス提供年月
     */
    住宅改修内容一覧_サービス提供年月,
    /**
     * 住宅改修内容一覧_整理番号
     */
    住宅改修内容一覧_整理番号,
    /**
     * 住宅改修内容一覧_様式番号
     */
    住宅改修内容一覧_様式番号,
    /**
     * 住宅改修内容一覧_モード
     */
    住宅改修内容一覧_モード,
    /**
     * 商品名
     */
    商品名,
    /**
     * 製造事業者
     */
    製造事業者,
    /**
     * 品目コード
     */
    品目コード,
    /**
     * 福祉用具商品名入力ガイド検索結果
     */
    福祉用具商品名入力ガイド検索結果,
    /**
     * 境界層該当者情報
     */
    境界層該当者情報,
    /**
     * 境界層措置申請情報
     */
    境界層措置申請情報,
    /**
     * 境界層保険料段階情報
     */
    境界層保険料段階情報
}
