/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbb.divcontroller.viewbox;

/**
 * 通知書発行後異動把握のViewStateKeys
 *
 * @reamsid_L DBB-9999-022 cuilin
 */
public enum ViewStateKeys {

    /**
     * キーが「発行日時Map」であることを表します
     */
    発行日時Map,
    /**
     * キーが「異動者一覧データ」であることを表します
     */
    異動者一覧データ,
    /**
     * キーが「異動者一覧Par」であることを表します
     */
    異動者一覧Par,
    /**
     * キーが「調定年度」であることを表します
     */
    調定年度,
    /**
     * キーが「賦課年度」であることを表します
     */
    賦課年度,
    /**
     * キーが「通知書番号」であることを表します
     */
    通知書番号,
    /**
     * キーが「履歴番号」であることを表します
     */
    履歴番号,
    /**
     * キーが「識別コード」であることを表します
     */
    識別コード,
    /**
     * キーが「被保険者番号」であることを表します
     */
    被保険者番号,
    /**
     * キーが「打分け方法情報キー」であることを表します
     */
    打分け方法情報キー,
    /**
     * キーが「賦課の情報リスト」であることを表します
     */
    賦課の情報リスト,
    /**
     * 徴収方法データ
     */
    徴収方法データ,
    /**
     * 特別徴収停止日時
     */
    特別徴収停止日時,
    /**
     * 特別徴収停止事由コード
     */
    特別徴収停止事由コード,
    /**
     * キーが「調定日時リスト」であることを表します
     */
    調定日時リスト,
    /**
     * キーが「発行する帳票リスト」であることを表します
     */
    発行する帳票リスト,
    /**
     * キーが「変更通知書帳票略称」であることを表します
     */
    変更通知書帳票略称,
    /**
     * キーが「減免通知書帳票略称」であることを表します
     */
    減免通知書帳票略称,
    /**
     * キーが「徴収猶予通知書帳票略称」であることを表します
     */
    徴収猶予通知書帳票略称,
    /**
     * キーが「処理日付管理」であることを表します
     */
    処理日付管理,
    /**
     * キーが「各種通知書作成フラグ」であることを表します
     */
    各種通知書作成フラグ,
    /**
     * キーが「各種通知書作成戻るフラグ」であることを表します
     */
    各種通知書作成戻るフラグ,
    /**
     * 帳票制御汎用リスト
     */
    帳票制御汎用リスト,
    /**
     * 実行フラグ
     */
    実行フラグ,
    /**
     * 所得照会状況一覧KEY
     */
    所得照会状況一覧KEY,
    /**
     * 特徴送付情報作成FLAG
     */
    特徴送付情報作成FLAG;

}
