/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbe.definition.enumeratedtype.core.ikensho;

/**
 * 主治医意見書の項目区分を表す列挙型です。
 *
 * @author N8156 宮本 康
 */
public enum ShujiiIkenshoItemKubun implements IShujiiIkenshoItemKubun {

    /**
     * 意見書項目区分が「診断名1」であることを表します。
     */
    診断名1,
    /**
     * 意見書項目区分が「発症年月日1」であることを表します。
     */
    発症年月日1,
    /**
     * 意見書項目区分が「診断名2」であることを表します。
     */
    診断名2,
    /**
     * 意見書項目区分が「発症年月日2」であることを表します。
     */
    発症年月日2,
    /**
     * 意見書項目区分が「診断名3」であることを表します。
     */
    診断名3,
    /**
     * 意見書項目区分が「発症年月日3」であることを表します。
     */
    発症年月日3,
    /**
     * 意見書項目区分が「症状の安定性」であることを表します。
     */
    症状の安定性,
    /**
     * 意見書項目区分が「具体的な状況」であることを表します。
     */
    具体的な状況,
    /**
     * 意見書項目区分が「治療内容」であることを表します。
     */
    治療内容,
    /**
     * 意見書項目区分が「点滴の管理」であることを表します。
     */
    点滴の管理,
    /**
     * 意見書項目区分が「中心静脈栄養」であることを表します。
     */
    中心静脈栄養,
    /**
     * 意見書項目区分が「透析」であることを表します。
     */
    透析,
    /**
     * 意見書項目区分が「ストーマの処置」であることを表します。
     */
    ストーマの処置,
    /**
     * 意見書項目区分が「酸素療法」であることを表します。
     */
    酸素療法,
    /**
     * 意見書項目区分が「レスピレーター」であることを表します。
     */
    レスピレーター,
    /**
     * 意見書項目区分が「気管切開の処置」であることを表します。
     */
    気管切開の処置,
    /**
     * 意見書項目区分が「疼痛の看護」であることを表します。
     */
    疼痛の看護,
    /**
     * 意見書項目区分が「経管栄養」であることを表します。
     */
    経管栄養,
    /**
     * 意見書項目区分が「モニター測定」であることを表します。
     */
    モニター測定,
    /**
     * 意見書項目区分が「褥瘡の処置」であることを表します。
     */
    褥瘡の処置,
    /**
     * 意見書項目区分が「カテーテル」であることを表します。
     */
    カテーテル,
    /**
     * 意見書項目区分が「障害高齢者日常生活自立度」であることを表します。
     */
    障害高齢者日常生活自立度,
    /**
     * 意見書項目区分が「認知症高齢者日常生活自立度」であることを表します。
     */
    認知症高齢者日常生活自立度,
    /**
     * 意見書項目区分が「短期記憶」であることを表します。
     */
    短期記憶,
    /**
     * 意見書項目区分が「認知能力」であることを表します。
     */
    認知能力,
    /**
     * 意見書項目区分が「伝達能力」であることを表します。
     */
    伝達能力,
    /**
     * 意見書項目区分が「認知症の周辺症状」であることを表します。
     */
    認知症の周辺症状,
    /**
     * 意見書項目区分が「幻視幻聴」であることを表します。
     */
    幻視幻聴,
    /**
     * 意見書項目区分が「妄想」であることを表します。
     */
    妄想,
    /**
     * 意見書項目区分が「昼夜逆転」であることを表します。
     */
    昼夜逆転,
    /**
     * 意見書項目区分が「暴言」であることを表します。
     */
    暴言,
    /**
     * 意見書項目区分が「暴行」であることを表します。
     */
    暴行,
    /**
     * 意見書項目区分が「介護への抵抗」であることを表します。
     */
    介護への抵抗,
    /**
     * 意見書項目区分が「認知症_徘徊」であることを表します。
     */
    認知症_徘徊,
    /**
     * 意見書項目区分が「火の不始末」であることを表します。
     */
    火の不始末,
    /**
     * 意見書項目区分が「不潔行為」であることを表します。
     */
    不潔行為,
    /**
     * 意見書項目区分が「異食行動」であることを表します。
     */
    異食行動,
    /**
     * 意見書項目区分が「性的問題行動」であることを表します。
     */
    性的問題行動,
    /**
     * 意見書項目区分が「認知症_その他」であることを表します。
     */
    認知症_その他,
    /**
     * 意見書項目区分が「認知症_その他内容」であることを表します。
     */
    認知症_その他内容,
    /**
     * 意見書項目区分が「精神_神経症状」であることを表します。
     */
    精神_神経症状,
    /**
     * 意見書項目区分が「精神_神経症状名」であることを表します。
     */
    精神_神経症状名,
    /**
     * 意見書項目区分が「専門科医受診」であることを表します。
     */
    専門科医受診,
    /**
     * 意見書項目区分が「専門科医受診内容」であることを表します。
     */
    専門科医受診内容,
    /**
     * 意見書項目区分が「利き腕」であることを表します。
     */
    利き腕,
    /**
     * 意見書項目区分が「身長」であることを表します。
     */
    身長,
    /**
     * 意見書項目区分が「体重」であることを表します。
     */
    体重,
    /**
     * 意見書項目区分が「体重の変化」であることを表します。
     */
    体重の変化,
    /**
     * 意見書項目区分が「四肢欠損」であることを表します。
     */
    四肢欠損,
    /**
     * 意見書項目区分が「四肢欠損部位」であることを表します。
     */
    四肢欠損部位,
    /**
     * 意見書項目区分が「四肢欠損程度」であることを表します。
     */
    四肢欠損程度,
    /**
     * 意見書項目区分が「麻痺」であることを表します。
     */
    麻痺,
    /**
     * 意見書項目区分が「麻痺程度」であることを表します。
     */
    麻痺程度,
    /**
     * 意見書項目区分が「麻痺_左上肢」であることを表します。
     */
    麻痺_左上肢,
    /**
     * 意見書項目区分が「麻痺_右上肢」であることを表します。
     */
    麻痺_右上肢,
    /**
     * 意見書項目区分が「麻痺_左下肢」であることを表します。
     */
    麻痺_左下肢,
    /**
     * 意見書項目区分が「麻痺_右下肢」であることを表します。
     */
    麻痺_右下肢,
    /**
     * 意見書項目区分が「麻痺_その他」であることを表します。
     */
    麻痺_その他,
    /**
     * 意見書項目区分が「筋力低下」であることを表します。
     */
    筋力低下,
    /**
     * 意見書項目区分が「筋力低下部位」であることを表します。
     */
    筋力低下部位,
    /**
     * 意見書項目区分が「筋力低下程度」であることを表します。
     */
    筋力低下程度,
    /**
     * 意見書項目区分が「関節の拘縮_右肩」であることを表します。
     */
    関節の拘縮_右肩,
    /**
     * 意見書項目区分が「関節の拘縮_左肩」であることを表します。
     */
    関節の拘縮_左肩,
    /**
     * 意見書項目区分が「関節の拘縮_右肘」であることを表します。
     */
    関節の拘縮_右肘,
    /**
     * 意見書項目区分が「関節の拘縮_左肘」であることを表します。
     */
    関節の拘縮_左肘,
    /**
     * 意見書項目区分が「関節の拘縮_右股」であることを表します。
     */
    関節の拘縮_右股,
    /**
     * 意見書項目区分が「関節の拘縮_左股」であることを表します。
     */
    関節の拘縮_左股,
    /**
     * 意見書項目区分が「関節の拘縮_右膝」であることを表します。
     */
    関節の拘縮_右膝,
    /**
     * 意見書項目区分が「関節の拘縮_左膝」であることを表します。
     */
    関節の拘縮_左膝,
    /**
     * 意見書項目区分が「関節の拘縮程度」であることを表します。
     */
    関節の拘縮程度,
    /**
     * 意見書項目区分が「関節の痛み」であることを表します。
     */
    関節の痛み,
    /**
     * 意見書項目区分が「関節の痛み部位」であることを表します。
     */
    関節の痛み部位,
    /**
     * 意見書項目区分が「関節の痛み程度」であることを表します。
     */
    関節の痛み程度,
    /**
     * 意見書項目区分が「失調不随意」であることを表します。
     */
    失調不随意,
    /**
     * 意見書項目区分が「失調不随意_右上肢」であることを表します。
     */
    失調不随意_右上肢,
    /**
     * 意見書項目区分が「失調不随意_左上肢」であることを表します。
     */
    失調不随意_左上肢,
    /**
     * 意見書項目区分が「失調不随意_右体幹」であることを表します。
     */
    失調不随意_右体幹,
    /**
     * 意見書項目区分が「失調不随意_左体幹」であることを表します。
     */
    失調不随意_左体幹,
    /**
     * 意見書項目区分が「失調不随意_右下肢」であることを表します。
     */
    失調不随意_右下肢,
    /**
     * 意見書項目区分が「失調不随意_左下肢」であることを表します。
     */
    失調不随意_左下肢,
    /**
     * 意見書項目区分が「じょくそう」であることを表します。
     */
    じょくそう,
    /**
     * 意見書項目区分が「じょくそう部位」であることを表します。
     */
    じょくそう部位,
    /**
     * 意見書項目区分が「じょくそう程度」であることを表します。
     */
    じょくそう程度,
    /**
     * 意見書項目区分が「その他皮膚疾患」であることを表します。
     */
    その他皮膚疾患,
    /**
     * 意見書項目区分が「その他皮膚疾患部位」であることを表します。
     */
    その他皮膚疾患部位,
    /**
     * 意見書項目区分が「その他皮膚疾患程度」であることを表します。
     */
    その他皮膚疾患程度,
    /**
     * 意見書項目区分が「屋外歩行」であることを表します。
     */
    屋外歩行,
    /**
     * 意見書項目区分が「車椅子の使用」であることを表します。
     */
    車椅子の使用,
    /**
     * 意見書項目区分が「歩行補助具_装具未使用」であることを表します。
     */
    歩行補助具_装具未使用,
    /**
     * 意見書項目区分が「歩行補助具_装具屋外使用」であることを表します。
     */
    歩行補助具_装具屋外使用,
    /**
     * 意見書項目区分が「歩行補助具_装具屋内使用」であることを表します。
     */
    歩行補助具_装具屋内使用,
    /**
     * 意見書項目区分が「食事行為」であることを表します。
     */
    食事行為,
    /**
     * 意見書項目区分が「現在の栄養状態」であることを表します。
     */
    現在の栄養状態,
    /**
     * 意見書項目区分が「栄養_食生活留意点」であることを表します。
     */
    栄養_食生活留意点,
    /**
     * 意見書項目区分が「尿失禁」であることを表します。
     */
    尿失禁,
    /**
     * 意見書項目区分が「転倒_骨折」であることを表します。
     */
    転倒_骨折,
    /**
     * 意見書項目区分が「移動能力の低下」であることを表します。
     */
    移動能力の低下,
    /**
     * 意見書項目区分が「褥瘡」であることを表します。
     */
    褥瘡,
    /**
     * 意見書項目区分が「閉じこもり」であることを表します。
     */
    閉じこもり,
    /**
     * 意見書項目区分が「意欲低下」であることを表します。
     */
    意欲低下,
    /**
     * 意見書項目区分が「徘徊」であることを表します。
     */
    徘徊,
    /**
     * 意見書項目区分が「低栄養」であることを表します。
     */
    低栄養,
    /**
     * 意見書項目区分が「摂食_嚥下機能低下」であることを表します。
     */
    摂食_嚥下機能低下,
    /**
     * 意見書項目区分が「脱水」であることを表します。
     */
    脱水,
    /**
     * 意見書項目区分が「易感染症」であることを表します。
     */
    易感染症,
    /**
     * 意見書項目区分が「がん等による疼痛」であることを表します。
     */
    がん等による疼痛,
    /**
     * 意見書項目区分が「その他状態」であることを表します。
     */
    その他状態,
    /**
     * 意見書項目区分が「その他状態内容」であることを表します。
     */
    その他状態内容,
    /**
     * 意見書項目区分が「嚥下性肺炎」であることを表します。
     */
    嚥下性肺炎,
    /**
     * 意見書項目区分が「腸閉塞」であることを表します。
     */
    腸閉塞,
    /**
     * 意見書項目区分が「心肺機能の低下」であることを表します。
     */
    心肺機能の低下,
    /**
     * 意見書項目区分が「痛み」であることを表します。
     */
    痛み,
    /**
     * 意見書項目区分が「状態対処方針」であることを表します。
     */
    状態対処方針,
    /**
     * 意見書項目区分が「介護の必要な程度に関する予後の見直し」であることを表します。
     */
    介護の必要な程度に関する予後の見直し,
    /**
     * 意見書項目区分が「サービス利用による生活機能の維持_改善の見通し」であることを表します。
     */
    サービス利用による生活機能の維持_改善の見通し,
    /**
     * 意見書項目区分が「訪問診療」であることを表します。
     */
    訪問診療,
    /**
     * 意見書項目区分が「短期入所療養介護」であることを表します。
     */
    短期入所療養介護,
    /**
     * 意見書項目区分が「訪問栄養食事指導」であることを表します。
     */
    訪問栄養食事指導,
    /**
     * 意見書項目区分が「訪問看護」であることを表します。
     */
    訪問看護,
    /**
     * 意見書項目区分が「訪問歯科診療」であることを表します。
     */
    訪問歯科診療,
    /**
     * 意見書項目区分が「訪問リハビリテーション」であることを表します。
     */
    訪問リハビリテーション,
    /**
     * 意見書項目区分が「訪問歯科衛生指導」であることを表します。
     */
    訪問歯科衛生指導,
    /**
     * 意見書項目区分が「通所リハビリテーション」であることを表します。
     */
    通所リハビリテーション,
    /**
     * 意見書項目区分が「訪問薬剤管理指導」であることを表します。
     */
    訪問薬剤管理指導,
    /**
     * 意見書項目区分が「その他医学的管理」であることを表します。
     */
    その他医学的管理,
    /**
     * 意見書項目区分が「血圧」であることを表します。
     */
    血圧,
    /**
     * 意見書項目区分が「血圧内容」であることを表します。
     */
    血圧内容,
    /**
     * 意見書項目区分が「摂食」であることを表します。
     */
    摂食,
    /**
     * 意見書項目区分が「摂食内容」であることを表します。
     */
    摂食内容,
    /**
     * 意見書項目区分が「嚥下」であることを表します。
     */
    嚥下,
    /**
     * 意見書項目区分が「嚥下内容」であることを表します。
     */
    嚥下内容,
    /**
     * 意見書項目区分が「移動」であることを表します。
     */
    移動,
    /**
     * 意見書項目区分が「移動内容」であることを表します。
     */
    移動内容,
    /**
     * 意見書項目区分が「運動」であることを表します。
     */
    運動,
    /**
     * 意見書項目区分が「運動内容」であることを表します。
     */
    運動内容,
    /**
     * 意見書項目区分が「その他留意事項」であることを表します。
     */
    その他留意事項,
    /**
     * 意見書項目区分が「感染症」であることを表します。
     */
    感染症,
    /**
     * 意見書項目区分が「感染症内容」であることを表します。
     */
    感染症内容,
    /**
     * 意見書項目区分が「特記事項」であることを表します。
     */
    特記事項,
    /**
     * 意見書項目区分が「特記事項イメージ」であることを表します。
     */
    特記事項イメージ,
    /**
     * 意見書項目区分が「看護職員の訪問による相談_支援」であることを表します。
     */
    看護職員の訪問による相談_支援;
}
