/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbu.divcontroller.viewbox;

/**
 * ViewStateKeys
 *
 * @reamsid_L DBU-9999-022 wangkanglei
 */
public enum ViewStateKeys {

    /**
     * 被保険者
     */
    被保険者,
    /**
     * 第1号被保険者数情報
     */
    第1号被保険者数情報,
    /**
     * 第1号被保険者増減内訳情報_当月中増
     */
    第1号被保険者増減内訳情報_当月中増,
    /**
     * 第1号被保険者増減内訳情報_当月中滅
     */
    第1号被保険者増減内訳情報_当月中滅,
    /**
     * 報告年月
     */
    報告年月,
    /**
     * 集計年月
     */
    集計年月,
    /**
     * 市町村コード
     */
    市町村コード,
    /**
     * 様式種類コード
     */
    様式種類コード,
    /**
     * 保険者コード
     */
    保険者コード,
    /**
     * 保険者名称
     */
    保険者名称,
    /**
     * 事業報告基本
     */
    事業報告基本,
    /**
     * 事業報告明細
     */
    事業報告明細,
    /**
     * 状態
     */
    状態,
    /**
     * 利用者負担第四段階
     */
    利用者負担第四段階,
    /**
     * 利用者負担第三段階
     */
    利用者負担第三段階,
    /**
     * 利用者負担第二段階
     */
    利用者負担第二段階,
    /**
     * 利用者負担第一段階
     */
    利用者負担第一段階,
    /**
     * 高額介護_合計
     */
    高額介護_合計,
    /**
     * 再掲利用者負担第三段階
     */
    再掲利用者負担第三段階,
    /**
     * 再掲利用者負担第二段階
     */
    再掲利用者負担第二段階,
    /**
     * 現役並み所得者
     */
    現役並み所得者,
    /**
     * 一般
     */
    一般,
    /**
     * 低所得者Ⅱ
     */
    低所得者Ⅱ,
    /**
     * 低所得者Ⅰ
     */
    低所得者Ⅰ,
    /**
     * 高額医療合算介護_合計
     */
    高額医療合算介護_合計,
    /**
     * 様式種類_11
     */
    様式種類_11,
    /**
     * 様式種類_12
     */
    様式種類_12,
    /**
     * 様式種類_21
     */
    様式種類_21,
    /**
     * 様式種類_22
     */
    様式種類_22,
    /**
     * 様式種類_31
     */
    様式種類_31,
    /**
     * 様式種類_32
     */
    様式種類_32,
    /**
     * 様式種類_41
     */
    様式種類_41,
    /**
     * 食費_居住費データリスト
     */
    食費_居住費データリスト,
    /**
     * 利用者負担滅額データリスト
     */
    利用者負担滅額データリスト,
    /**
     * 特定負担限度額データリスト
     */
    特定負担限度額データリスト,
    /**
     * 利用者負担データリスト
     */
    利用者負担データリスト,
    /**
     * 要介護データリスト
     */
    要介護データリスト,
    /**
     * 居宅介護データリスト
     */
    居宅介護データリスト,
    /**
     * 地域密着型データリスト
     */
    地域密着型データリスト,
    /**
     * 施設介護1データリスト
     */
    施設介護1データリスト,
    /**
     * 施設介護2データリスト
     */
    施設介護2データリスト,
    /**
     * 施設介護3データリスト
     */
    施設介護3データリスト,
    /**
     * 市町村Entiyリスト
     */
    市町村Entiyリスト,
}
