/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbu.divcontroller.viewbox;

/**
 *
 *
 */
public enum ViewStateKeys {

    /**
     * 被保険者
     */
    被保険者,
    /**
     * 第1号被保険者数情報
     */
    第1号被保険者数情報,
    /**
     * 第1号被保険者増減内訳情報_当月中増
     */
    第1号被保険者増減内訳情報_当月中増,
    /**
     * 第1号被保険者増減内訳情報_当月中滅
     */
    第1号被保険者増減内訳情報_当月中滅,
    /**
     * 報告年月
     */
    報告年月,
    /**
     * 集計年月
     */
    集計年月,
    /**
     * 市町村コード
     */
    市町村コード,
    /**
     * 様式種類コード
     */
    様式種類コード,
    /**
     * 保険者コード
     */
    保険者コード,
    /**
     * 保険者名称
     */
    保険者名称,
    /**
     * 事業報告基本
     */
    事業報告基本,
    /**
     * 事業報告明細
     */
    事業報告明細,
    /**
     * 状態
     */
    状態,
    /**
     * 利用者負担第四段階
     */
    利用者負担第四段階,
    /**
     * 利用者負担第三段階
     */
    利用者負担第三段階,
    /**
     * 利用者負担第二段階
     */
    利用者負担第二段階,
    /**
     * 利用者負担第一段階
     */
    利用者負担第一段階,
    /**
     * 高額介護_合計
     */
    高額介護_合計,
    /**
     * 再掲利用者負担第三段階
     */
    再掲利用者負担第三段階,
    /**
     * 再掲利用者負担第二段階
     */
    再掲利用者負担第二段階,
    /**
     * 現役並み所得者
     */
    現役並み所得者,
    /**
     * 一般
     */
    一般,
    /**
     * 低所得者Ⅱ
     */
    低所得者Ⅱ,
    /**
     * 低所得者Ⅰ
     */
    低所得者Ⅰ,
    /**
     * 高額医療合算介護_合計
     */
    高額医療合算介護_合計
}
