package jp.co.ndensan.reams.db.dbz.definition.core.ninteichosahyou;

import jp.co.ndensan.reams.ur.urz.definition.message.UrSystemErrorMessages;
import jp.co.ndensan.reams.uz.uza.lang.RString;

/**
 * 認定調査票09Bを表す列挙型です。
 *
 * @reamsid_L DBZ-9999-023 wangchao
 */
public enum NinteichosaKomokuMapping09B {

    /**
     * コード:1 名称:麻痺等の有無（左上肢） 表示番号:1-1-1 パターンNo:1 略称:定義なし
     */
    麻痺等_左上肢("1", "麻痺等の有無（左上肢）", "1-1-1", "1"),
    /**
     * コード:2 名称:麻痺等の有無（右上肢） 表示番号:1-1-2 パターンNo:1 略称:定義なし
     */
    麻痺等_右上肢("2", "麻痺等の有無（右上肢）", "1-1-2", "1"),
    /**
     * コード:3 名称:麻痺等の有無（左下肢） 表示番号:1-1-3 パターンNo:1 略称:定義なし
     */
    麻痺等_左下肢("3", "麻痺等の有無（左下肢）", "1-1-3", "1"),
    /**
     * コード:4 名称:麻痺等の有無（右下肢） 表示番号:1-1-4 パターンNo:1 略称:定義なし
     */
    麻痺等_右下肢("4", "麻痺等の有無（右下肢）", "1-1-4", "1"),
    /**
     * コード:5 名称:麻痺等の有無（その他） 表示番号:1-1-5 パターンNo:1 略称:定義なし
     */
    麻痺等_その他("5", "麻痺等の有無（その他）", "1-1-5", "1"),
    /**
     * コード:6 名称:拘縮の有無（肩関節） 表示番号:1-2-1 パターンNo:1 略称:定義なし
     */
    拘縮_肩関節("6", "拘縮の有無（肩関節）", "1-2-1", "1"),
    /**
     * コード:7 名称:拘縮の有無（股関節） 表示番号:1-2-2 パターンNo:1 略称:定義なし
     */
    拘縮_股関節("7", "拘縮の有無（股関節）", "1-2-2", "1"),
    /**
     * コード:8 名称:拘縮の有無（膝関節） 表示番号:1-2-3 パターンNo:1 略称:定義なし
     */
    拘縮_膝関節("8", "拘縮の有無（膝関節）", "1-2-3", "1"),
    /**
     * コード:9 名称:拘縮の有無（その他） 表示番号:1-2-4 パターンNo:1 略称:定義なし
     */
    拘縮_その他("9", "拘縮の有無（その他）", "1-2-4", "1"),
    /**
     * コード:10 名称:寝返り 表示番号:1-3 パターンNo:2 略称:定義なし
     */
    寝返り("10", "寝返り", "1-3", "2"),
    /**
     * コード:11 名称:起き上がり 表示番号:1-4 パターンNo:2 略称:定義なし
     */
    起き上がり("11", "起き上がり", "1-4", "2"),
    /**
     * コード:12 名称:座位保持 表示番号:1-5 パターンNo:3 略称:定義なし
     */
    座位保持("12", "座位保持", "1-5", "3"),
    /**
     * コード:13 名称:両足での立位 表示番号:1-6 パターンNo:4 略称:定義なし
     */
    両足での立位("13", "両足での立位", "1-6", "4"),
    /**
     * コード:14 名称:歩行 表示番号:1-7 パターンNo:2 略称:定義なし
     */
    歩行("14", "歩行", "1-7", "2"),
    /**
     * コード:15 名称:立ち上がり 表示番号:1-8 パターンNo:2 略称:定義なし
     */
    立ち上がり("15", "立ち上がり", "1-8", "2"),
    /**
     * コード:16 名称:片足での立位 表示番号:1-9 パターンNo:4 略称:定義なし
     */
    片足での立位("16", "片足での立位", "1-9", "4"),
    /**
     * コード:17 名称:洗身 表示番号:1-10 パターンNo:6 略称:定義なし
     */
    洗身("17", "洗身", "1-10", "6"),
    /**
     * コード:18 名称:つめ切り 表示番号:1-11 パターンNo:7 略称:定義なし
     */
    つめ切り("18", "つめ切り", "1-11", "7"),
    /**
     * コード:19 名称:視力 表示番号:1-12 パターンNo:8 略称:定義なし
     */
    視力("19", "視力", "1-12", "8"),
    /**
     * コード:20 名称:聴力 表示番号:1-13 パターンNo:9 略称:定義なし
     */
    聴力("20", "聴力", "1-13", "9"),
    /**
     * コード:21 名称:移乗 表示番号:2-1 パターンNo:10 略称:定義なし
     */
    移乗("21", "移乗", "2-1", "10"),
    /**
     * コード:22 名称:移動 表示番号:2-2 パターンNo:10 略称:定義なし
     */
    移動("22", "移動", "2-2", "10"),
    /**
     * コード:23 名称:嚥下 表示番号:2-3 パターンNo:11 略称:定義なし
     */
    えん下("23", "嚥下", "2-3", "11"),
    /**
     * コード:24 名称:食事摂取 表示番号:2-4 パターンNo:10 略称:定義なし
     */
    食事摂取("24", "食事摂取", "2-4", "10"),
    /**
     * コード:25 名称:排尿 表示番号:2-5 パターンNo:10 略称:定義なし
     */
    排尿("25", "排尿", "2-5", "10"),
    /**
     * コード:26 名称:排便 表示番号:2-6 パターンNo:10 略称:定義なし
     */
    排便("26", "排便", "2-6", "10"),
    /**
     * コード:27 名称:口腔清潔 表示番号:2-7 パターンNo:12 略称:定義なし
     */
    口腔清潔("27", "口腔清潔", "2-7", "12"),
    /**
     * コード:28 名称:洗顔 表示番号:2-8 パターンNo:12 略称:定義なし
     */
    洗顔("28", "洗顔", "2-8", "12"),
    /**
     * コード:29 名称:整髪 表示番号:2-9 パターンNo:12 略称:定義なし
     */
    整髪("29", "整髪", "2-9", "12"),
    /**
     * コード:30 名称:上衣の着脱 表示番号:2-10 パターンNo:10 略称:定義なし
     */
    上衣の着脱("30", "上衣の着脱", "2-10", "10"),
    /**
     * コード:31 名称:ズボン等の着脱 表示番号:2-11 パターンNo:10 略称:定義なし
     */
    ズボン等の着脱("31", "ズボン等の着脱", "2-11", "10"),
    /**
     * コード:32 名称:外出頻度 表示番号:2-12 パターンNo:13 略称:定義なし
     */
    外出頻度("32", "外出頻度", "2-12", "13"),
    /**
     * コード:33 名称:意思の伝達 表示番号:3-1 パターンNo:14 略称:定義なし
     */
    意思の伝達("33", "意思の伝達", "3-1", "14"),
    /**
     * コード:34 名称:毎日の日課を理解 表示番号:3-2 パターンNo:15 略称:定義なし
     */
    毎日の日課を理解("34", "毎日の日課を理解", "3-2", "15"),
    /**
     * コード:35 名称:生年月日をいう 表示番号:3-3 パターンNo:15 略称:定義なし
     */
    生年月日をいう("35", "生年月日をいう", "3-3", "15"),
    /**
     * コード:36 名称:短期記憶 表示番号:3-4 パターンNo:15 略称:定義なし
     */
    短期記憶("36", "短期記憶", "3-4", "15"),
    /**
     * コード:37 名称:自分の名前をいう 表示番号:3-5 パターンNo:15 略称:定義なし
     */
    自分の名前をいう("37", "自分の名前をいう", "3-5", "15"),
    /**
     * コード:38 名称:今の季節を理解 表示番号:3-6 パターンNo:15 略称:定義なし
     */
    今の季節を理解("38", "今の季節を理解", "3-6", "15"),
    /**
     * コード:39 名称:場所の理解 表示番号:3-7 パターンNo:15 略称:定義なし
     */
    場所の理解("39", "場所の理解", "3-7", "15"),
    /**
     * コード:40 名称:常時の徘徊 表示番号:3-8 パターンNo:15 略称:定義なし
     */
    常時の徘徊("40", "常時の徘徊", "3-8", "16"),
    /**
     * コード:41 名称:外出して戻れない 表示番号:3-9 パターンNo:16 略称:定義なし
     */
    外出して戻れない("41", "外出して戻れない", "3-9", "16"),
    /**
     * コード:42 名称:被害的 表示番号:4-1 パターンNo:16 略称:定義なし
     */
    被害的("42", "被害的", "4-1", "16"),
    /**
     * コード:43 名称:作話 表示番号:4-2 パターンNo:16 略称:定義なし
     */
    作話("43", "作話", "4-2", "16"),
    /**
     * コード:44 名称:感情が不安定 表示番号:4-3 パターンNo:16 略称:定義なし
     */
    感情が不安定("44", "感情が不安定", "4-3", "16"),
    /**
     * コード:45 名称:昼夜逆転 表示番号:4-4 パターンNo:16 略称:定義なし
     */
    昼夜逆転("45", "昼夜逆転", "4-4", "16"),
    /**
     * コード:46 名称:同じ話をする 表示番号:4-5 パターンNo:16 略称:定義なし
     */
    同じ話をする("46", "同じ話をする", "4-5", "16"),
    /**
     * コード:47 名称:大声を出す 表示番号:4-6 パターンNo:16 略称:定義なし
     */
    大声を出す("47", "大声を出す", "4-6", "16"),
    /**
     * コード:48 名称:介護に抵抗 表示番号:4-7 パターンNo:16 略称:定義なし
     */
    介護に抵抗("48", "介護に抵抗", "4-7", "16"),
    /**
     * コード:49 名称:落ち着きなし 表示番号:4-8 パターンNo:16 略称:定義なし
     */
    落ち着きなし("49", "落ち着きなし", "4-8", "16"),
    /**
     * コード:50 名称:一人で出たがる 表示番号:4-9 パターンNo:16 略称:定義なし
     */
    一人で出たがる("50", "一人で出たがる", "4-9", "16"),
    /**
     * コード:51 名称:収集癖 表示番号:4-10 パターンNo:16 略称:定義なし
     */
    収集癖("51", "収集癖", "4-10", "16"),
    /**
     * コード:52 名称:物や衣類を壊す 表示番号:4-11 パターンNo:16 略称:定義なし
     */
    物や衣類を壊す("52", "物や衣類を壊す", "4-11", "16"),
    /**
     * コード:53 名称:ひどい物忘れ 表示番号:4-12 パターンNo:16 略称:定義なし
     */
    ひどい物忘れ("53", "ひどい物忘れ", "4-12", "16"),
    /**
     * コード:54 名称:独り言・独り笑い 表示番号:4-13 パターンNo:16 略称:定義なし
     */
    独り言_独り笑い("54", "独り言・独り笑い", "4-13", "16"),
    /**
     * コード:55 名称:自分勝手に行動する 表示番号:4-14 パターンNo:16 略称:定義なし
     */
    自分勝手に行動する("55", "自分勝手に行動する", "4-14", "16"),
    /**
     * コード:56 名称:話がまとまらない 表示番号:4-15 パターンNo:16 略称:定義なし
     */
    話がまとまらない("56", "話がまとまらない", "4-15", "16"),
    /**
     * コード:57 名称:薬の内服 表示番号:5-1 パターンNo:12 略称:定義なし
     */
    薬の内服("57", "薬の内服", "5-1", "12"),
    /**
     * コード:58 名称:金銭の管理 表示番号:5-2 パターンNo:12 略称:定義なし
     */
    金銭の管理("58", "金銭の管理", "5-2", "12"),
    /**
     * コード:59 名称:日常の意思決定 表示番号:5-3 パターンNo:17 略称:定義なし
     */
    日常の意思決定("59", "日常の意思決定", "5-3", "17"),
    /**
     * コード:60 名称:集団への不適応 表示番号:5-4 パターンNo:16 略称:定義なし
     */
    集団への不適応("60", "集団への不適応", "5-4", "16"),
    /**
     * コード:61 名称:買い物 表示番号:5-5 パターンNo:10 略称:定義なし
     */
    買い物("61", "買い物", "5-5", "10"),
    /**
     * コード:62 名称:簡単な調理 表示番号:5-6 パターンNo:10 略称:定義なし
     */
    簡単な調理("62", "簡単な調理", "5-6", "10"),
    /**
     * コード:63 名称:処置内容（点滴の管理）表示番号:特医-1 パターンNo:1 略称:定義なし
     */
    点滴の管理("63", "処置内容（点滴の管理）", "特医-1", "1"),
    /**
     * コード:64 名称:処置内容（中心静脈栄養） 表示番号:特医-2 パターンNo:1 略称:定義なし
     */
    中心静脈栄養("64", "処置内容（中心静脈栄養）", "特医-2", "1"),
    /**
     * コード:65 名称:処置内容（透析） 表示番号:特医-3 パターンNo:1 略称:定義なし
     */
    透析("65", "処置内容（透析）", "特医-3", "1"),
    /**
     * コード:66 名称:処置内容（ストーマの処置） 表示番号:特医-4 パターンNo:1 略称:定義なし
     */
    ストーマの処置("66", "処置内容（ストーマの処置）", "特医-4", "1"),
    /**
     * コード:67 名称:処置内容（酸素療法） 表示番号:特医-5 パターンNo:1 略称:定義なし
     */
    酸素療法("67", "処置内容（酸素療法）", "特医-5", "1"),
    /**
     * コード:68 名称:処置内容（レスピレーター） 表示番号:特医-6 パターンNo:1 略称:定義なし
     */
    レスピレーター("68", "処置内容（レスピレーター）", "特医-6", "1"),
    /**
     * コード:69 名称:処置内容（気管切開の処置） 表示番号:特医-7 パターンNo:1 略称:定義なし
     */
    気管切開の処置("69", "処置内容（気管切開の処置）", "特医-7", "1"),
    /**
     * コード:70 名称:処置内容（疼痛の看護） 表示番号:特医-8 パターンNo:1 略称:定義なし
     */
    疼痛の看護("70", "処置内容（疼痛の看護）", "特医-8", "1"),
    /**
     * コード:71 名称:処置内容（経管栄養）表示番号:特医-9 パターンNo:1 略称:定義なし
     */
    経管栄養("71", "処置内容（経管栄養）", "特医-9", "1"),
    /**
     * コード:72 名称:特別な対応（モニター測定） 表示番号:特医-10 パターンNo:1 略称:定義なし
     */
    モニター測定("72", "特別な対応（モニター測定）", "特医-10", "1"),
    /**
     * コード:73 名称:特別な対応（じょくそうの処置） 表示番号:特医-11 パターンNo:1 略称:定義なし
     */
    じょくそうの処置("73", "特別な対応（じょくそうの処置）", "特医-11", "1"),
    /**
     * コード:74 名称:失禁への対応（カテーテル）表示番号:特医-12 パターンNo:1 略称:定義なし
     */
    カテーテル("74", "失禁への対応（カテーテル）", "特医-12", "1");

    private final RString code;
    private final RString fullName;
    private final RString 表示番号;
    private final RString パターンNo;

    private NinteichosaKomokuMapping09B(String code, String fullname, String 表示番号, String パターンNo) {
        this.code = new RString(code);
        this.fullName = new RString(fullname);
        this.表示番号 = new RString(表示番号);
        this.パターンNo = new RString(パターンNo);
    }

    /**
     * 認定調査票09Bのコードを返します。
     *
     * @return 認定調査票09Bのコード
     */
    public RString getコード() {
        return code;
    }

    /**
     * 認定調査票99Bの表示番号を返します。
     *
     * @return 認定調査票99Bの表示番号
     */
    public RString get表示番号() {
        return 表示番号;
    }

    /**
     * 認定調査票99BのパターンNoを返します。
     *
     * @return 認定調査票99BのパターンNo
     */
    public RString getパターンNo() {
        return パターンNo;
    }

    /**
     * 認定調査票09Bの名称を返します。
     *
     * @return 認定調査票09Bの名称
     */
    public RString get名称() {
        return fullName;
    }

    /**
     * 認定調査票09Bのコードと一致する内容を探します。
     *
     * @param code 認定調査票09Bのコード
     * @return {@code code} に対応する認定調査票09B
     */
    public static NinteichosaKomokuMapping09B toValue(RString code) {
        for (NinteichosaKomokuMapping09B ninteichosaKomokuMapping09B : NinteichosaKomokuMapping09B.values()) {
            if (ninteichosaKomokuMapping09B.code.equals(code)) {
                return ninteichosaKomokuMapping09B;
            }
        }
        throw new IllegalArgumentException(UrSystemErrorMessages.変換不可.getReplacedMessage(" 認定調査票09B"));
    }
}
