/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.core.configkeys;

import jp.co.ndensan.reams.uz.uza.lang.RString;

/**
 * コンフィグ名称(DBB)を表す列挙型です。
 */
public enum ConfigNameDBB {

    /**
     * コード:無し 名称:動作関連_特徴分配集約システム 略称:定義なし
     */
    動作関連_特徴分配集約システム("動作関連_特徴分配集約システム"),
    /**
     * コード:無し 名称:日付関連_調定年度 略称:定義なし
     */
    日付関連_調定年度("日付関連_調定年度"),
    /**
     * コード:無し 名称:日付関連_月別テーブル1 略称:定義なし
     */
    日付関連_月別テーブル1("日付関連_月別テーブル1"),
    /**
     * コード:無し 名称:日付関連_月別テーブル2 略称:定義なし
     */
    日付関連_月別テーブル2("日付関連_月別テーブル2"),
    /**
     * コード:無し 名称:日付関連_月別テーブル3 略称:定義なし
     */
    日付関連_月別テーブル3("日付関連_月別テーブル3"),
    /**
     * コード:無し 名称:日付関連_月別テーブル4 略称:定義なし
     */
    日付関連_月別テーブル4("日付関連_月別テーブル4"),
    /**
     * コード:無し 名称:日付関連_月別テーブル5 略称:定義なし
     */
    日付関連_月別テーブル5("日付関連_月別テーブル5"),
    /**
     * コード:無し 名称:日付関連_月別テーブル6 略称:定義なし
     */
    日付関連_月別テーブル6("日付関連_月別テーブル6"),
    /**
     * コード:無し 名称:日付関連_月別テーブル7 略称:定義なし
     */
    日付関連_月別テーブル7("日付関連_月別テーブル7"),
    /**
     * コード:無し 名称:日付関連_月別テーブル8 略称:定義なし
     */
    日付関連_月別テーブル8("日付関連_月別テーブル8"),
    /**
     * コード:無し 名称:日付関連_月別テーブル9 略称:定義なし
     */
    日付関連_月別テーブル9("日付関連_月別テーブル9"),
    /**
     * コード:無し 名称:日付関連_月別テーブル10 略称:定義なし
     */
    日付関連_月別テーブル10("日付関連_月別テーブル10"),
    /**
     * コード:無し 名称:日付関連_月別テーブル11 略称:定義なし
     */
    日付関連_月別テーブル11("日付関連_月別テーブル11"),
    /**
     * コード:無し 名称:日付関連_月別テーブル12 略称:定義なし
     */
    日付関連_月別テーブル12("日付関連_月別テーブル12"),
    /**
     * コード:無し 名称:日付関連_月別テーブル13 略称:定義なし
     */
    日付関連_月別テーブル13("日付関連_月別テーブル13"),
    /**
     * コード:無し 名称:日付関連_月別テーブル14 略称:定義なし
     */
    日付関連_月別テーブル14("日付関連_月別テーブル14"),
    /**
     * コード:無し 名称:普徴期情報_月の期1 略称:定義なし
     */
    普徴期情報_月の期1("普徴期情報_月の期1"),
    /**
     * コード:無し 名称:普徴期情報_月の期2 略称:定義なし
     */
    普徴期情報_月の期2("普徴期情報_月の期2"),
    /**
     * コード:無し 名称:普徴期情報_月の期3 略称:定義なし
     */
    普徴期情報_月の期3("普徴期情報_月の期3"),
    /**
     * コード:無し 名称:普徴期情報_月の期4 略称:定義なし
     */
    普徴期情報_月の期4("普徴期情報_月の期4"),
    /**
     * コード:無し 名称:普徴期情報_月の期5 略称:定義なし
     */
    普徴期情報_月の期5("普徴期情報_月の期5"),
    /**
     * コード:無し 名称:普徴期情報_月の期6 略称:定義なし
     */
    普徴期情報_月の期6("普徴期情報_月の期6"),
    /**
     * コード:無し 名称:普徴期情報_月の期7 略称:定義なし
     */
    普徴期情報_月の期7("普徴期情報_月の期7"),
    /**
     * コード:無し 名称:普徴期情報_月の期8 略称:定義なし
     */
    普徴期情報_月の期8("普徴期情報_月の期8"),
    /**
     * コード:無し 名称:普徴期情報_月の期9 略称:定義なし
     */
    普徴期情報_月の期9("普徴期情報_月の期9"),
    /**
     * コード:無し 名称:普徴期情報_月の期10 略称:定義なし
     */
    普徴期情報_月の期10("普徴期情報_月の期10"),
    /**
     * コード:無し 名称:普徴期情報_月の期11 略称:定義なし
     */
    普徴期情報_月の期11("普徴期情報_月の期11"),
    /**
     * コード:無し 名称:普徴期情報_月の期12 略称:定義なし
     */
    普徴期情報_月の期12("普徴期情報_月の期12"),
    /**
     * コード:無し 名称:普徴期情報_月の期13 略称:定義なし
     */
    普徴期情報_月の期13("普徴期情報_月の期13"),
    /**
     * コード:無し 名称:普徴期情報_月の期14 略称:定義なし
     */
    普徴期情報_月の期14("普徴期情報_月の期14"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分1 略称:定義なし
     */
    普徴期情報_月処理区分1("普徴期情報_月処理区分1"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分2 略称:定義なし
     */
    普徴期情報_月処理区分2("普徴期情報_月処理区分2"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分3 略称:定義なし
     */
    普徴期情報_月処理区分3("普徴期情報_月処理区分3"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分4 略称:定義なし
     */
    普徴期情報_月処理区分4("普徴期情報_月処理区分4"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分5 略称:定義なし
     */
    普徴期情報_月処理区分5("普徴期情報_月処理区分5"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分6 略称:定義なし
     */
    普徴期情報_月処理区分6("普徴期情報_月処理区分6"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分7 略称:定義なし
     */
    普徴期情報_月処理区分7("普徴期情報_月処理区分7"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分8 略称:定義なし
     */
    普徴期情報_月処理区分8("普徴期情報_月処理区分8"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分9 略称:定義なし
     */
    普徴期情報_月処理区分9("普徴期情報_月処理区分9"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分10 略称:定義なし
     */
    普徴期情報_月処理区分10("普徴期情報_月処理区分10"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分11 略称:定義なし
     */
    普徴期情報_月処理区分11("普徴期情報_月処理区分11"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分12 略称:定義なし
     */
    普徴期情報_月処理区分12("普徴期情報_月処理区分12"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分13 略称:定義なし
     */
    普徴期情報_月処理区分13("普徴期情報_月処理区分13"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分14 略称:定義なし
     */
    普徴期情報_月処理区分14("普徴期情報_月処理区分14"),
    /**
     * コード:無し 名称:過年度_歳出管理区分 略称:定義なし
     */
    過年度_歳出管理区分("過年度_歳出管理区分"),
    /**
     * コード:無し 名称:特徴期情報_月の期1 略称:定義なし
     */
    特徴期情報_月の期1("特徴期情報_月の期1"),
    /**
     * コード:無し 名称:特徴期情報_月の期2 略称:定義なし
     */
    特徴期情報_月の期2("特徴期情報_月の期2"),
    /**
     * コード:無し 名称:特徴期情報_月の期3 略称:定義なし
     */
    特徴期情報_月の期3("特徴期情報_月の期3"),
    /**
     * コード:無し 名称:特徴期情報_月の期4 略称:定義なし
     */
    特徴期情報_月の期4("特徴期情報_月の期4"),
    /**
     * コード:無し 名称:特徴期情報_月の期5 略称:定義なし
     */
    特徴期情報_月の期5("特徴期情報_月の期5"),
    /**
     * コード:無し 名称:特徴期情報_月の期6 略称:定義なし
     */
    特徴期情報_月の期6("特徴期情報_月の期6"),
    /**
     * コード:無し 名称:特徴期情報_月の期7 略称:定義なし
     */
    特徴期情報_月の期7("特徴期情報_月の期7"),
    /**
     * コード:無し 名称:特徴期情報_月の期8 略称:定義なし
     */
    特徴期情報_月の期8("特徴期情報_月の期8"),
    /**
     * コード:無し 名称:特徴期情報_月の期9 略称:定義なし
     */
    特徴期情報_月の期9("特徴期情報_月の期9"),
    /**
     * コード:無し 名称:特徴期情報_月の期10 略称:定義なし
     */
    特徴期情報_月の期10("特徴期情報_月の期10"),
    /**
     * コード:無し 名称:特徴期情報_月の期11 略称:定義なし
     */
    特徴期情報_月の期11("特徴期情報_月の期11"),
    /**
     * コード:無し 名称:特徴期情報_月の期12 略称:定義なし
     */
    特徴期情報_月の期12("特徴期情報_月の期12"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分1 略称:定義なし
     */
    特徴期情報_月処理区分1("特徴期情報_月処理区分1"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分2 略称:定義なし
     */
    特徴期情報_月処理区分2("特徴期情報_月処理区分2"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分3 略称:定義なし
     */
    特徴期情報_月処理区分3("特徴期情報_月処理区分3"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分4 略称:定義なし
     */
    特徴期情報_月処理区分4("特徴期情報_月処理区分4"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分5 略称:定義なし
     */
    特徴期情報_月処理区分5("特徴期情報_月処理区分5"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分6 略称:定義なし
     */
    特徴期情報_月処理区分6("特徴期情報_月処理区分6"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分7 略称:定義なし
     */
    特徴期情報_月処理区分7("特徴期情報_月処理区分7"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分8 略称:定義なし
     */
    特徴期情報_月処理区分8("特徴期情報_月処理区分8"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分9 略称:定義なし
     */
    特徴期情報_月処理区分9("特徴期情報_月処理区分9"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分10 略称:定義なし
     */
    特徴期情報_月処理区分10("特徴期情報_月処理区分10"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分11 略称:定義なし
     */
    特徴期情報_月処理区分11("特徴期情報_月処理区分11"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分12 略称:定義なし
     */
    特徴期情報_月処理区分12("特徴期情報_月処理区分12"),
    /**
     * コード:無し 名称:過年度期情報_月の期1 略称:定義なし
     */
    過年度期情報_月の期1("過年度期情報_月の期1"),
    /**
     * コード:無し 名称:過年度期情報_月の期2 略称:定義なし
     */
    過年度期情報_月の期2("過年度期情報_月の期2"),
    /**
     * コード:無し 名称:過年度期情報_月の期3 略称:定義なし
     */
    過年度期情報_月の期3("過年度期情報_月の期3"),
    /**
     * コード:無し 名称:過年度期情報_月の期4 略称:定義なし
     */
    過年度期情報_月の期4("過年度期情報_月の期4"),
    /**
     * コード:無し 名称:過年度期情報_月の期5 略称:定義なし
     */
    過年度期情報_月の期5("過年度期情報_月の期5"),
    /**
     * コード:無し 名称:過年度期情報_月の期6 略称:定義なし
     */
    過年度期情報_月の期6("過年度期情報_月の期6"),
    /**
     * コード:無し 名称:過年度期情報_月の期7 略称:定義なし
     */
    過年度期情報_月の期7("過年度期情報_月の期7"),
    /**
     * コード:無し 名称:過年度期情報_月の期8 略称:定義なし
     */
    過年度期情報_月の期8("過年度期情報_月の期8"),
    /**
     * コード:無し 名称:過年度期情報_月の期9 略称:定義なし
     */
    過年度期情報_月の期9("過年度期情報_月の期9"),
    /**
     * コード:無し 名称:過年度期情報_月の期10 略称:定義なし
     */
    過年度期情報_月の期10("過年度期情報_月の期10"),
    /**
     * コード:無し 名称:過年度期情報_月の期11 略称:定義なし
     */
    過年度期情報_月の期11("過年度期情報_月の期11"),
    /**
     * コード:無し 名称:過年度期情報_月の期12 略称:定義なし
     */
    過年度期情報_月の期12("過年度期情報_月の期12"),
    /**
     * コード:無し 名称:日付関連_更正月判定日数 略称:定義なし
     */
    日付関連_更正月判定日数("日付関連_更正月判定日数");
    private final RString fullName;

    private ConfigNameDBB(String fullname) {
        this.fullName = new RString(fullname);
    }

    /**
     * コンフィグ名称(DBB)の名称を返します。
     *
     * @return コンフィグ名称(DBB)の名称
     */
    public RString get名称() {
        return fullName;
    }
}
