/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbx.definition.core.configkeys;

import jp.co.ndensan.reams.uz.uza.lang.RString;

/**
 * コンフィグ名称(DBB)を表す列挙型です。
 */
public enum ConfigNameDBB {

    /**
     * コード:無し 名称:ランク管理情報_不均一納期期限 略称:定義なし
     */
    ランク管理情報_不均一納期期限("ランク管理情報_不均一納期期限"),
    /**
     * コード:無し 名称:動作関連_特徴分配集約システム 略称:定義なし
     */
    動作関連_特徴分配集約システム("動作関連_特徴分配集約システム"),
    /**
     * コード:無し 名称:日付関連_調定年度 略称:定義なし
     */
    日付関連_調定年度("日付関連_調定年度"),
    /**
     * コード:無し 名称:日付関連_月別テーブル1 略称:定義なし
     */
    日付関連_月別テーブル1("日付関連_月別テーブル1"),
    /**
     * コード:無し 名称:日付関連_月別テーブル2 略称:定義なし
     */
    日付関連_月別テーブル2("日付関連_月別テーブル2"),
    /**
     * コード:無し 名称:日付関連_月別テーブル3 略称:定義なし
     */
    日付関連_月別テーブル3("日付関連_月別テーブル3"),
    /**
     * コード:無し 名称:日付関連_月別テーブル4 略称:定義なし
     */
    日付関連_月別テーブル4("日付関連_月別テーブル4"),
    /**
     * コード:無し 名称:日付関連_月別テーブル5 略称:定義なし
     */
    日付関連_月別テーブル5("日付関連_月別テーブル5"),
    /**
     * コード:無し 名称:日付関連_月別テーブル6 略称:定義なし
     */
    日付関連_月別テーブル6("日付関連_月別テーブル6"),
    /**
     * コード:無し 名称:日付関連_月別テーブル7 略称:定義なし
     */
    日付関連_月別テーブル7("日付関連_月別テーブル7"),
    /**
     * コード:無し 名称:日付関連_月別テーブル8 略称:定義なし
     */
    日付関連_月別テーブル8("日付関連_月別テーブル8"),
    /**
     * コード:無し 名称:日付関連_月別テーブル9 略称:定義なし
     */
    日付関連_月別テーブル9("日付関連_月別テーブル9"),
    /**
     * コード:無し 名称:日付関連_月別テーブル10 略称:定義なし
     */
    日付関連_月別テーブル10("日付関連_月別テーブル10"),
    /**
     * コード:無し 名称:日付関連_月別テーブル11 略称:定義なし
     */
    日付関連_月別テーブル11("日付関連_月別テーブル11"),
    /**
     * コード:無し 名称:日付関連_月別テーブル12 略称:定義なし
     */
    日付関連_月別テーブル12("日付関連_月別テーブル12"),
    /**
     * コード:無し 名称:日付関連_月別テーブル13 略称:定義なし
     */
    日付関連_月別テーブル13("日付関連_月別テーブル13"),
    /**
     * コード:無し 名称:日付関連_月別テーブル14 略称:定義なし
     */
    日付関連_月別テーブル14("日付関連_月別テーブル14"),
    /**
     * コード:無し 名称:普徴期情報_月の期1 略称:定義なし
     */
    普徴期情報_月の期1("普徴期情報_月の期1"),
    /**
     * コード:無し 名称:普徴期情報_月の期2 略称:定義なし
     */
    普徴期情報_月の期2("普徴期情報_月の期2"),
    /**
     * コード:無し 名称:普徴期情報_月の期3 略称:定義なし
     */
    普徴期情報_月の期3("普徴期情報_月の期3"),
    /**
     * コード:無し 名称:普徴期情報_月の期4 略称:定義なし
     */
    普徴期情報_月の期4("普徴期情報_月の期4"),
    /**
     * コード:無し 名称:普徴期情報_月の期5 略称:定義なし
     */
    普徴期情報_月の期5("普徴期情報_月の期5"),
    /**
     * コード:無し 名称:普徴期情報_月の期6 略称:定義なし
     */
    普徴期情報_月の期6("普徴期情報_月の期6"),
    /**
     * コード:無し 名称:普徴期情報_月の期7 略称:定義なし
     */
    普徴期情報_月の期7("普徴期情報_月の期7"),
    /**
     * コード:無し 名称:普徴期情報_月の期8 略称:定義なし
     */
    普徴期情報_月の期8("普徴期情報_月の期8"),
    /**
     * コード:無し 名称:普徴期情報_月の期9 略称:定義なし
     */
    普徴期情報_月の期9("普徴期情報_月の期9"),
    /**
     * コード:無し 名称:普徴期情報_月の期10 略称:定義なし
     */
    普徴期情報_月の期10("普徴期情報_月の期10"),
    /**
     * コード:無し 名称:普徴期情報_月の期11 略称:定義なし
     */
    普徴期情報_月の期11("普徴期情報_月の期11"),
    /**
     * コード:無し 名称:普徴期情報_月の期12 略称:定義なし
     */
    普徴期情報_月の期12("普徴期情報_月の期12"),
    /**
     * コード:無し 名称:普徴期情報_月の期13 略称:定義なし
     */
    普徴期情報_月の期13("普徴期情報_月の期13"),
    /**
     * コード:無し 名称:普徴期情報_月の期14 略称:定義なし
     */
    普徴期情報_月の期14("普徴期情報_月の期14"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分1 略称:定義なし
     */
    普徴期情報_月処理区分1("普徴期情報_月処理区分1"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分2 略称:定義なし
     */
    普徴期情報_月処理区分2("普徴期情報_月処理区分2"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分3 略称:定義なし
     */
    普徴期情報_月処理区分3("普徴期情報_月処理区分3"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分4 略称:定義なし
     */
    普徴期情報_月処理区分4("普徴期情報_月処理区分4"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分5 略称:定義なし
     */
    普徴期情報_月処理区分5("普徴期情報_月処理区分5"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分6 略称:定義なし
     */
    普徴期情報_月処理区分6("普徴期情報_月処理区分6"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分7 略称:定義なし
     */
    普徴期情報_月処理区分7("普徴期情報_月処理区分7"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分8 略称:定義なし
     */
    普徴期情報_月処理区分8("普徴期情報_月処理区分8"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分9 略称:定義なし
     */
    普徴期情報_月処理区分9("普徴期情報_月処理区分9"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分10 略称:定義なし
     */
    普徴期情報_月処理区分10("普徴期情報_月処理区分10"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分11 略称:定義なし
     */
    普徴期情報_月処理区分11("普徴期情報_月処理区分11"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分12 略称:定義なし
     */
    普徴期情報_月処理区分12("普徴期情報_月処理区分12"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分13 略称:定義なし
     */
    普徴期情報_月処理区分13("普徴期情報_月処理区分13"),
    /**
     * コード:無し 名称:普徴期情報_月処理区分14 略称:定義なし
     */
    普徴期情報_月処理区分14("普徴期情報_月処理区分14"),
    /**
     * コード:無し 名称:過年度_歳出管理区分 略称:定義なし
     */
    過年度_歳出管理区分("過年度_歳出管理区分"),
    /**
     * コード:無し 名称:期割計算_普徴切替方法 略称:定義なし
     */
    期割計算_普徴切替方法("期割計算_普徴切替方法"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_6月分 略称:定義なし
     */
    特別徴収_平準化計算方法_6月分("特別徴収_平準化計算方法_6月分"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_8月分 略称:定義なし
     */
    特別徴収_平準化計算方法_8月分("特別徴収_平準化計算方法_8月分"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_8月分増額 略称:定義なし
     */
    特別徴収_平準化計算方法_8月分増額("特別徴収_平準化計算方法_8月分増額"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_8月分減額 略称:定義なし
     */
    特別徴収_平準化計算方法_8月分減額("特別徴収_平準化計算方法_8月分減額"),
    /**
     * コード:無し 名称:特別徴収_年額基準年度_4月開始 略称:定義なし
     */
    特別徴収_年額基準年度_4月開始("特別徴収_年額基準年度_4月開始"),
    /**
     * コード:無し 名称:特別徴収_年額基準年度_6月開始 略称:定義なし
     */
    特別徴収_年額基準年度_6月開始("特別徴収_年額基準年度_6月開始"),
    /**
     * コード:無し 名称:特別徴収_年額基準年度_8月開始 略称:定義なし
     */
    特別徴収_年額基準年度_8月開始("特別徴収_年額基準年度_8月開始"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル1 略称:定義なし
     */
    特別徴収_期別テーブル1("特別徴収_期別テーブル1"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル2 略称:定義なし
     */
    特別徴収_期別テーブル2("特別徴収_期別テーブル2"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル3 略称:定義なし
     */
    特別徴収_期別テーブル3("特別徴収_期別テーブル3"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル4 略称:定義なし
     */
    特別徴収_期別テーブル4("特別徴収_期別テーブル4"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル5 略称:定義なし
     */
    特別徴収_期別テーブル5("特別徴収_期別テーブル5"),
    /**
     * コード:無し 名称:特別徴収_期別テーブル6 略称:定義なし
     */
    特別徴収_期別テーブル6("特別徴収_期別テーブル6"),
    /**
     * コード:無し 名称:特別徴収_期別端数 略称:定義なし
     */
    特別徴収_期別端数("特別徴収_期別端数"),
    /**
     * コード:無し 名称:特別徴収_特徴開始前普通徴収_6月 略称:定義なし
     */
    特別徴収_特徴開始前普通徴収_6月("特別徴収_特徴開始前普通徴収_6月"),
    /**
     * コード:無し 名称:特別徴収_特徴開始前普通徴収_8月 略称:定義なし
     */
    特別徴収_特徴開始前普通徴収_8月("特別徴収_特徴開始前普通徴収_8月"),
    /**
     * コード:無し 名称:特別徴収_特徴開始前普通徴収_10月 略称:定義なし
     */
    特別徴収_特徴開始前普通徴収_10月("特別徴収_特徴開始前普通徴収_10月"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_2月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_2月捕捉("特別徴収_特徴開始月_2月捕捉"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_4月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_4月捕捉("特別徴収_特徴開始月_4月捕捉"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_6月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_6月捕捉("特別徴収_特徴開始月_6月捕捉"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_8月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_8月捕捉("特別徴収_特徴開始月_8月捕捉"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_10月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_10月捕捉("特別徴収_特徴開始月_10月捕捉"),
    /**
     * コード:無し 名称:特別徴収_特徴開始月_12月捕捉 略称:定義なし
     */
    特別徴収_特徴開始月_12月捕捉("特別徴収_特徴開始月_12月捕捉"),
    /**
     * コード:無し 名称:特徴期情報_仮算定期数 略称:定義なし
     */
    特徴期情報_仮算定期数("特徴期情報_仮算定期数"),
    /**
     * コード:無し 名称:特徴期情報_設定納期数 略称:定義なし
     */
    特徴期情報_設定納期数("特徴期情報_設定納期数"),
    /**
     * コード:無し 名称:特別徴収_依頼金額計算方法_12月開始 略称:定義なし
     */
    特別徴収_依頼金額計算方法_12月開始("特別徴収_依頼金額計算方法_12月開始"),
    /**
     * コード:無し 名称:特別徴収_依頼金額計算方法_2月開始 略称:定義なし
     */
    特別徴収_依頼金額計算方法_2月開始("特別徴収_依頼金額計算方法_2月開始"),
    /**
     * コード:無し 名称:特別徴収_依頼金額計算方法_4月開始 略称:定義なし
     */
    特別徴収_依頼金額計算方法_4月開始("特別徴収_依頼金額計算方法_4月開始"),
    /**
     * コード:無し 名称:特別徴収_依頼金額計算方法_6月開始 略称:定義なし
     */
    特別徴収_依頼金額計算方法_6月開始("特別徴収_依頼金額計算方法_6月開始"),
    /**
     * コード:無し 名称:特別徴収_依頼金額計算方法_8月開始 略称:定義なし
     */
    特別徴収_依頼金額計算方法_8月開始("特別徴収_依頼金額計算方法_8月開始"),
    /**
     * コード:無し 名称:特徴期情報_月の期1 略称:定義なし
     */
    特徴期情報_月の期1("特徴期情報_月の期1"),
    /**
     * コード:無し 名称:特徴期情報_月の期2 略称:定義なし
     */
    特徴期情報_月の期2("特徴期情報_月の期2"),
    /**
     * コード:無し 名称:特徴期情報_月の期3 略称:定義なし
     */
    特徴期情報_月の期3("特徴期情報_月の期3"),
    /**
     * コード:無し 名称:特徴期情報_月の期4 略称:定義なし
     */
    特徴期情報_月の期4("特徴期情報_月の期4"),
    /**
     * コード:無し 名称:特徴期情報_月の期5 略称:定義なし
     */
    特徴期情報_月の期5("特徴期情報_月の期5"),
    /**
     * コード:無し 名称:特徴期情報_月の期6 略称:定義なし
     */
    特徴期情報_月の期6("特徴期情報_月の期6"),
    /**
     * コード:無し 名称:特徴期情報_月の期7 略称:定義なし
     */
    特徴期情報_月の期7("特徴期情報_月の期7"),
    /**
     * コード:無し 名称:特徴期情報_月の期8 略称:定義なし
     */
    特徴期情報_月の期8("特徴期情報_月の期8"),
    /**
     * コード:無し 名称:特徴期情報_月の期9 略称:定義なし
     */
    特徴期情報_月の期9("特徴期情報_月の期9"),
    /**
     * コード:無し 名称:特徴期情報_月の期10 略称:定義なし
     */
    特徴期情報_月の期10("特徴期情報_月の期10"),
    /**
     * コード:無し 名称:特徴期情報_月の期11 略称:定義なし
     */
    特徴期情報_月の期11("特徴期情報_月の期11"),
    /**
     * コード:無し 名称:特徴期情報_月の期12 略称:定義なし
     */
    特徴期情報_月の期12("特徴期情報_月の期12"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分1 略称:定義なし
     */
    特徴期情報_月処理区分1("特徴期情報_月処理区分1"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分2 略称:定義なし
     */
    特徴期情報_月処理区分2("特徴期情報_月処理区分2"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分3 略称:定義なし
     */
    特徴期情報_月処理区分3("特徴期情報_月処理区分3"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分4 略称:定義なし
     */
    特徴期情報_月処理区分4("特徴期情報_月処理区分4"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分5 略称:定義なし
     */
    特徴期情報_月処理区分5("特徴期情報_月処理区分5"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分6 略称:定義なし
     */
    特徴期情報_月処理区分6("特徴期情報_月処理区分6"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分7 略称:定義なし
     */
    特徴期情報_月処理区分7("特徴期情報_月処理区分7"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分8 略称:定義なし
     */
    特徴期情報_月処理区分8("特徴期情報_月処理区分8"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分9 略称:定義なし
     */
    特徴期情報_月処理区分9("特徴期情報_月処理区分9"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分10 略称:定義なし
     */
    特徴期情報_月処理区分10("特徴期情報_月処理区分10"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分11 略称:定義なし
     */
    特徴期情報_月処理区分11("特徴期情報_月処理区分11"),
    /**
     * コード:無し 名称:特徴期情報_月処理区分12 略称:定義なし
     */
    特徴期情報_月処理区分12("特徴期情報_月処理区分12"),
    /**
     * コード:無し 名称:過年度期情報_月の期1 略称:定義なし
     */
    過年度期情報_月の期1("過年度期情報_月の期1"),
    /**
     * コード:無し 名称:過年度期情報_月の期2 略称:定義なし
     */
    過年度期情報_月の期2("過年度期情報_月の期2"),
    /**
     * コード:無し 名称:過年度期情報_月の期3 略称:定義なし
     */
    過年度期情報_月の期3("過年度期情報_月の期3"),
    /**
     * コード:無し 名称:過年度期情報_月の期4 略称:定義なし
     */
    過年度期情報_月の期4("過年度期情報_月の期4"),
    /**
     * コード:無し 名称:過年度期情報_月の期5 略称:定義なし
     */
    過年度期情報_月の期5("過年度期情報_月の期5"),
    /**
     * コード:無し 名称:過年度期情報_月の期6 略称:定義なし
     */
    過年度期情報_月の期6("過年度期情報_月の期6"),
    /**
     * コード:無し 名称:過年度期情報_月の期7 略称:定義なし
     */
    過年度期情報_月の期7("過年度期情報_月の期7"),
    /**
     * コード:無し 名称:過年度期情報_月の期8 略称:定義なし
     */
    過年度期情報_月の期8("過年度期情報_月の期8"),
    /**
     * コード:無し 名称:過年度期情報_月の期9 略称:定義なし
     */
    過年度期情報_月の期9("過年度期情報_月の期9"),
    /**
     * コード:無し 名称:過年度期情報_月の期10 略称:定義なし
     */
    過年度期情報_月の期10("過年度期情報_月の期10"),
    /**
     * コード:無し 名称:過年度期情報_月の期11 略称:定義なし
     */
    過年度期情報_月の期11("過年度期情報_月の期11"),
    /**
     * コード:無し 名称:過年度期情報_月の期12 略称:定義なし
     */
    過年度期情報_月の期12("過年度期情報_月の期12"),
    /**
     * コード:無し 名称:日付関連_更正月判定日数 略称:定義なし
     */
    日付関連_更正月判定日数("日付関連_更正月判定日数"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_6月分減額 略称:定義なし
     */
    特別徴収_平準化計算方法_6月分減額("特別徴収_平準化計算方法_6月分減額"),
    /**
     * コード:無し 名称:特別徴収_平準化計算方法_6月分増額 略称:定義なし
     */
    特別徴収_平準化計算方法_6月分増額("特別徴収_平準化計算方法_6月分増額"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置1 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置1("普徴期情報_コンビニカット印字位置1"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置2 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置2("普徴期情報_コンビニカット印字位置2"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置3 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置3("普徴期情報_コンビニカット印字位置3"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置4 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置4("普徴期情報_コンビニカット印字位置4"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置5 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置5("普徴期情報_コンビニカット印字位置5"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置6 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置6("普徴期情報_コンビニカット印字位置6"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置7 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置7("普徴期情報_コンビニカット印字位置7"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置8 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置8("普徴期情報_コンビニカット印字位置8"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置9 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置9("普徴期情報_コンビニカット印字位置9"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置10 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置10("普徴期情報_コンビニカット印字位置10"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置11 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置11("普徴期情報_コンビニカット印字位置11"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置12 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置12("普徴期情報_コンビニカット印字位置12"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置13 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置13("普徴期情報_コンビニカット印字位置13"),
    /**
     * コード:無し 名称:普徴期情報_コンビニカット印字位置14 略称:定義なし
     */
    普徴期情報_コンビニカット印字位置14("普徴期情報_コンビニカット印字位置14"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置1 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置1("普徴期情報_コンビニ連帳印字位置1"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置2 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置2("普徴期情報_コンビニ連帳印字位置2"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置3 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置3("普徴期情報_コンビニ連帳印字位置3"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置4 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置4("普徴期情報_コンビニ連帳印字位置4"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置5 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置5("普徴期情報_コンビニ連帳印字位置5"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置6 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置6("普徴期情報_コンビニ連帳印字位置6"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置7 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置7("普徴期情報_コンビニ連帳印字位置7"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置8 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置8("普徴期情報_コンビニ連帳印字位置8"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置9 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置9("普徴期情報_コンビニ連帳印字位置9"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置10 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置10("普徴期情報_コンビニ連帳印字位置10"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置11 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置11("普徴期情報_コンビニ連帳印字位置11"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置12 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置12("普徴期情報_コンビニ連帳印字位置12"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置13 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置13("普徴期情報_コンビニ連帳印字位置13"),
    /**
     * コード:無し 名称:普徴期情報_コンビニ連帳印字位置14 略称:定義なし
     */
    普徴期情報_コンビニ連帳印字位置14("普徴期情報_コンビニ連帳印字位置14"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置1 略称:定義なし
     */
    普徴期情報_納付書の印字位置1("普徴期情報_納付書の印字位置1"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置2 略称:定義なし
     */
    普徴期情報_納付書の印字位置2("普徴期情報_納付書の印字位置2"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置3 略称:定義なし
     */
    普徴期情報_納付書の印字位置3("普徴期情報_納付書の印字位置3"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置4 略称:定義なし
     */
    普徴期情報_納付書の印字位置4("普徴期情報_納付書の印字位置4"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置5 略称:定義なし
     */
    普徴期情報_納付書の印字位置5("普徴期情報_納付書の印字位置5"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置6 略称:定義なし
     */
    普徴期情報_納付書の印字位置6("普徴期情報_納付書の印字位置6"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置7 略称:定義なし
     */
    普徴期情報_納付書の印字位置7("普徴期情報_納付書の印字位置7"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置8 略称:定義なし
     */
    普徴期情報_納付書の印字位置8("普徴期情報_納付書の印字位置8"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置9 略称:定義なし
     */
    普徴期情報_納付書の印字位置9("普徴期情報_納付書の印字位置9"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置10 略称:定義なし
     */
    普徴期情報_納付書の印字位置10("普徴期情報_納付書の印字位置10"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置11 略称:定義なし
     */
    普徴期情報_納付書の印字位置11("普徴期情報_納付書の印字位置11"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置12 略称:定義なし
     */
    普徴期情報_納付書の印字位置12("普徴期情報_納付書の印字位置12"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置13 略称:定義なし
     */
    普徴期情報_納付書の印字位置13("普徴期情報_納付書の印字位置13"),
    /**
     * コード:無し 名称:普徴期情報_納付書の印字位置14 略称:定義なし
     */
    普徴期情報_納付書の印字位置14("普徴期情報_納付書の印字位置14"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置1 略称:定義なし
     */
    普徴期情報_ブック開始位置1("普徴期情報_ブック開始位置1"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置2 略称:定義なし
     */
    普徴期情報_ブック開始位置2("普徴期情報_ブック開始位置2"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置3 略称:定義なし
     */
    普徴期情報_ブック開始位置3("普徴期情報_ブック開始位置3"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置4 略称:定義なし
     */
    普徴期情報_ブック開始位置4("普徴期情報_ブック開始位置4"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置5 略称:定義なし
     */
    普徴期情報_ブック開始位置5("普徴期情報_ブック開始位置5"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置6 略称:定義なし
     */
    普徴期情報_ブック開始位置6("普徴期情報_ブック開始位置6"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置7 略称:定義なし
     */
    普徴期情報_ブック開始位置7("普徴期情報_ブック開始位置7"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置8 略称:定義なし
     */
    普徴期情報_ブック開始位置8("普徴期情報_ブック開始位置8"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置9 略称:定義なし
     */
    普徴期情報_ブック開始位置9("普徴期情報_ブック開始位置9"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置10 略称:定義なし
     */
    普徴期情報_ブック開始位置10("普徴期情報_ブック開始位置10"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置11 略称:定義なし
     */
    普徴期情報_ブック開始位置11("普徴期情報_ブック開始位置11"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置12 略称:定義なし
     */
    普徴期情報_ブック開始位置12("普徴期情報_ブック開始位置12"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置13 略称:定義なし
     */
    普徴期情報_ブック開始位置13("普徴期情報_ブック開始位置13"),
    /**
     * コード:無し 名称:普徴期情報_ブック開始位置14 略称:定義なし
     */
    普徴期情報_ブック開始位置14("普徴期情報_ブック開始位置14"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置1 略称:定義なし
     */
    過年度期情報_納付書の印字位置1("過年度期情報_納付書の印字位置1"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置2 略称:定義なし
     */
    過年度期情報_納付書の印字位置2("過年度期情報_納付書の印字位置2"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置3 略称:定義なし
     */
    過年度期情報_納付書の印字位置3("過年度期情報_納付書の印字位置3"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置4 略称:定義なし
     */
    過年度期情報_納付書の印字位置4("過年度期情報_納付書の印字位置4"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置5 略称:定義なし
     */
    過年度期情報_納付書の印字位置5("過年度期情報_納付書の印字位置5"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置6 略称:定義なし
     */
    過年度期情報_納付書の印字位置6("過年度期情報_納付書の印字位置6"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置7 略称:定義なし
     */
    過年度期情報_納付書の印字位置7("過年度期情報_納付書の印字位置7"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置8 略称:定義なし
     */
    過年度期情報_納付書の印字位置8("過年度期情報_納付書の印字位置8"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置9 略称:定義なし
     */
    過年度期情報_納付書の印字位置9("過年度期情報_納付書の印字位置9"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置10 略称:定義なし
     */
    過年度期情報_納付書の印字位置10("過年度期情報_納付書の印字位置10"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置11 略称:定義なし
     */
    過年度期情報_納付書の印字位置11("過年度期情報_納付書の印字位置11"),
    /**
     * コード:無し 名称:過年度期情報_納付書の印字位置12 略称:定義なし
     */
    過年度期情報_納付書の印字位置12("過年度期情報_納付書の印字位置12"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置1 略称:定義なし
     */
    過年度期情報_ブック開始位置1("過年度期情報_ブック開始位置1"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置2 略称:定義なし
     */
    過年度期情報_ブック開始位置2("過年度期情報_ブック開始位置2"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置3 略称:定義なし
     */
    過年度期情報_ブック開始位置3("過年度期情報_ブック開始位置3"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置4 略称:定義なし
     */
    過年度期情報_ブック開始位置4("過年度期情報_ブック開始位置4"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置5 略称:定義なし
     */
    過年度期情報_ブック開始位置5("過年度期情報_ブック開始位置5"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置6 略称:定義なし
     */
    過年度期情報_ブック開始位置6("過年度期情報_ブック開始位置6"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置7 略称:定義なし
     */
    過年度期情報_ブック開始位置7("過年度期情報_ブック開始位置7"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置8 略称:定義なし
     */
    過年度期情報_ブック開始位置8("過年度期情報_ブック開始位置8"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置9 略称:定義なし
     */
    過年度期情報_ブック開始位置9("過年度期情報_ブック開始位置9"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置10 略称:定義なし
     */
    過年度期情報_ブック開始位置10("過年度期情報_ブック開始位置10"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置11 略称:定義なし
     */
    過年度期情報_ブック開始位置11("過年度期情報_ブック開始位置11"),
    /**
     * コード:無し 名称:過年度期情報_ブック開始位置12 略称:定義なし
     */
    過年度期情報_ブック開始位置12("過年度期情報_ブック開始位置12"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置1 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置1("過年度期情報_コンビニカット印字位置1"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置2 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置2("過年度期情報_コンビニカット印字位置2"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置3 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置3("過年度期情報_コンビニカット印字位置3"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置4 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置4("過年度期情報_コンビニカット印字位置4"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置5 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置5("過年度期情報_コンビニカット印字位置5"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置6 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置6("過年度期情報_コンビニカット印字位置6"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置7 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置7("過年度期情報_コンビニカット印字位置7"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置8 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置8("過年度期情報_コンビニカット印字位置8"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置9 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置9("過年度期情報_コンビニカット印字位置9"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置10 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置10("過年度期情報_コンビニカット印字位置10"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置11 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置11("過年度期情報_コンビニカット印字位置11"),
    /**
     * コード:無し 名称:過年度期情報_コンビニカット印字位置12 略称:定義なし
     */
    過年度期情報_コンビニカット印字位置12("過年度期情報_コンビニカット印字位置12"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置1 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置1("過年度期情報_コンビニ連帳印字位置1"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置2 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置2("過年度期情報_コンビニ連帳印字位置2"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置3 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置3("過年度期情報_コンビニ連帳印字位置3"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置4 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置4("過年度期情報_コンビニ連帳印字位置4"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置5 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置5("過年度期情報_コンビニ連帳印字位置5"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置6 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置6("過年度期情報_コンビニ連帳印字位置6"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置7 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置7("過年度期情報_コンビニ連帳印字位置7"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置8 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置8("過年度期情報_コンビニ連帳印字位置8"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置9 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置9("過年度期情報_コンビニ連帳印字位置9"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置10 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置10("過年度期情報_コンビニ連帳印字位置10"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置11 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置11("過年度期情報_コンビニ連帳印字位置11"),
    /**
     * コード:無し 名称:過年度期情報_コンビニ連帳印字位置12 略称:定義なし
     */
    過年度期情報_コンビニ連帳印字位置12("過年度期情報_コンビニ連帳印字位置12");
    private final RString fullName;

    private ConfigNameDBB(String fullname) {
        this.fullName = new RString(fullname);
    }

    /**
     * コンフィグ名称(DBB)の名称を返します。
     *
     * @return コンフィグ名称(DBB)の名称
     */
    public RString get名称() {
        return fullName;
    }
}
