/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.enumeratedtype;

/**
 * 該当者検索のコンフィグキーです。
 *
 * @author N8156 宮本 康
 */
public enum ConfigKeysGaitoshaKensaku {

    /**
     * コンフィグキーが「検索画面設定_カーソル位置」であることを表します。
     */
    検索画面設定_カーソル位置,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_被保険者対象有無」であることを表します。
     */
    検索画面設定_検索オプション_被保険者対象有無,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_要介護認定者対象有無」であることを表します。
     */
    検索画面設定_検索オプション_要介護認定者対象有無,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_住所地特例者対象有無」であることを表します。
     */
    検索画面設定_検索オプション_住所地特例者対象有無,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_他市町村住所地特例者対象有無」であることを表します。
     */
    検索画面設定_検索オプション_他市町村住所地特例者対象有無,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_適用除外者対象有無」であることを表します。
     */
    検索画面設定_検索オプション_適用除外者対象有無,
    /**
     * コンフィグキーが「検索画面設定_検索オプション_前方一致条件有無」であることを表します。
     */
    検索画面設定_検索オプション_前方一致条件有無,
    /**
     * コンフィグキーが「検索制御_広域保険者_被保険者番号検索制御」であることを表します。
     */
    検索制御_広域保険者_被保険者番号検索制御,
    /**
     * コンフィグキーが「検索制御_最大取得件数」であることを表します。
     */
    検索制御_最大取得件数,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護資格」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護資格,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護受給」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護受給,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護認定」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護認定,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護賦課」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護賦課,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護給付」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護給付,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_介護共通」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_介護共通,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_宛名」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_宛名,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_収滞納管理」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_収滞納管理,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_口座管理」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_口座管理,
    /**
     * コンフィグキーが「広域内住所地特例者検索制御_措置元_措置先区分_会計受入」であることを表します。
     */
    広域内住所地特例者検索制御_措置元_措置先区分_会計受入;
}
