/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.enumeratedtype;

/**
 * 普通徴収のコンフィグキーです。
 *
 * @author N8156 宮本 康
 */
public enum ConfigKeysFucho {

    /**
     * コンフィグキーが「普徴期情報_月の期1」であることを表します。
     */
    普徴期情報_月の期1,
    /**
     * コンフィグキーが「普徴期情報_月の期2」であることを表します。
     */
    普徴期情報_月の期2,
    /**
     * コンフィグキーが「普徴期情報_月の期3」であることを表します。
     */
    普徴期情報_月の期3,
    /**
     * コンフィグキーが「普徴期情報_月の期4」であることを表します。
     */
    普徴期情報_月の期4,
    /**
     * コンフィグキーが「普徴期情報_月の期5」であることを表します。
     */
    普徴期情報_月の期5,
    /**
     * コンフィグキーが「普徴期情報_月の期6」であることを表します。
     */
    普徴期情報_月の期6,
    /**
     * コンフィグキーが「普徴期情報_月の期7」であることを表します。
     */
    普徴期情報_月の期7,
    /**
     * コンフィグキーが「普徴期情報_月の期8」であることを表します。
     */
    普徴期情報_月の期8,
    /**
     * コンフィグキーが「普徴期情報_月の期9」であることを表します。
     */
    普徴期情報_月の期9,
    /**
     * コンフィグキーが「普徴期情報_月の期10」であることを表します。
     */
    普徴期情報_月の期10,
    /**
     * コンフィグキーが「普徴期情報_月の期11」であることを表します。
     */
    普徴期情報_月の期11,
    /**
     * コンフィグキーが「普徴期情報_月の期12」であることを表します。
     */
    普徴期情報_月の期12,
    /**
     * コンフィグキーが「普徴期情報_月の期13」であることを表します。
     */
    普徴期情報_月の期13,
    /**
     * コンフィグキーが「普徴期情報_月の期14」であることを表します。
     */
    普徴期情報_月の期14;
}
