/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package jp.co.ndensan.reams.db.dbz.definition.enumeratedtype;

/**
 * 保険者情報のコンフィグキーです。
 *
 * @author N8156 宮本 康
 */
public enum ConfigKeysHokenshaJoho {

    /**
     * コンフィグキーが「保険者情報_保険者構成」であることを表します。
     */
    保険者情報_保険者構成,
    /**
     * コンフィグキーが「保険者情報_保険者番号」であることを表します。
     */
    保険者情報_保険者番号,
    /**
     * コンフィグキーが「保険者情報_保険者名称」であることを表します。
     */
    保険者情報_保険者名称,
    /**
     * コンフィグキーが「保険者情報_最優先地区コード」であることを表します。
     */
    保険者情報_最優先地区コード,
    /**
     * コンフィグキーが「保険者情報_住所」であることを表します。
     */
    保険者情報_住所,
    /**
     * コンフィグキーが「保険者情報_電話番号」であることを表します。
     */
    保険者情報_電話番号,
    /**
     * コンフィグキーが「保険者情報_郵便番号」であることを表します。
     */
    保険者情報_郵便番号,
    /**
     * コンフィグキーが「保険者情報_広域タイプ」であることを表します。
     */
    保険者情報_広域タイプ,
    /**
     * コンフィグキーが「保険者情報_広域システム構成」であることを表します。
     */
    保険者情報_広域システム構成,
    /**
     * コンフィグキーが「保険者情報_移行タイプ」であることを表します。
     */
    保険者情報_移行タイプ,
    /**
     * コンフィグキーが「保険者情報_個別事項連携有無区分」であることを表します。
     */
    保険者情報_個別事項連携有無区分;
}
